#Область ПрограммныйИнтерфейс

Процедура ИнициализацияПодсистемы() Экспорт 	
	
	Если Не ЗначениеЗаполнено(ТУРВ_РаботаСФункциямиКлиентСервер.Результат(РегистрыСведений.ТУРВ_НастройкиСервиса.НастройкиСервиса()).АдресСервера) Тогда
		Возврат;
	КонецЕсли; 
	
	//Считаем что это инициализация
	НайденныйЭлемент = Справочники.ТУРВ_СтатусыТабелей.НайтиПоКоду(1);
	Если Не ЗначениеЗаполнено(НайденныйЭлемент) Тогда
		
		НовыйЭлемент = Справочники.ТУРВ_СтатусыТабелей.СоздатьЭлемент();
		НовыйЭлемент.Наименование = "Новый";
		НовыйЭлемент.Код = 1;
		НовыйЭлемент.Записать();
		
		
		НовыйЭлемент = Справочники.ТУРВ_СтатусыТабелей.СоздатьЭлемент();
		НовыйЭлемент.Наименование = "Отправлен 1С";
		НовыйЭлемент.Код = 2;
		НовыйЭлемент.Записать();
		
		НовыйЭлемент = Справочники.ТУРВ_СтатусыТабелей.СоздатьЭлемент();
		НовыйЭлемент.Наименование = "В работе";
		НовыйЭлемент.Код = 3;
		НовыйЭлемент.Записать();
		
		НовыйЭлемент = Справочники.ТУРВ_СтатусыТабелей.СоздатьЭлемент();
		НовыйЭлемент.Наименование = "Отменена";
		НовыйЭлемент.Код = 4;
		НовыйЭлемент.Записать();
		
		НовыйЭлемент = Справочники.ТУРВ_СтатусыТабелей.СоздатьЭлемент();
		НовыйЭлемент.Наименование = "Выполнена";
		НовыйЭлемент.Код = 5;
		НовыйЭлемент.Записать();
		
		Выборка = Справочники.ТУРВ_СтатусыТабелей.Выбрать();
		Пока Выборка.Следующий() Цикл 
			РегистрыСведений.ТУРВ_ОчередьОбменаСсылочнымиДанными.ЗарегистрироватьДобавлениеОбъекта(Выборка.Ссылка);
		КонецЦикла;	
		
		
		Выборка = Справочники.ВидыИспользованияРабочегоВремени.Выбрать();
		Пока Выборка.Следующий() Цикл 
			ТУРВ_ОбработкаСобытийСервер.ЗарегистрироватьЗаписьСсылочногоОбъекта(Выборка.Ссылка, Истина);
		КонецЦикла;	
		
		Выборка = Справочники.ГрафикиРаботыСотрудников.Выбрать();
		Пока Выборка.Следующий() Цикл 
			
			ТУРВ_ОбработкаСобытийСервер.ЗарегистрироватьЗаписьСсылочногоОбъекта(Выборка.Ссылка, Истина);
			
			Запрос = Новый Запрос;
			Запрос.Текст =" 
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	ГрафикиРаботыПоВидамВремени.Месяц КАК Месяц,
			|	ГрафикиРаботыПоВидамВремени.ГрафикРаботы КАК ГрафикРаботы
			|ИЗ
			|	РегистрСведений.ГрафикиРаботыПоВидамВремени КАК ГрафикиРаботыПоВидамВремени
			|ГДЕ
			|	ГрафикиРаботыПоВидамВремени.ГрафикРаботы = &ГрафикРаботы
			|
			|УПОРЯДОЧИТЬ ПО
			|	Месяц
			|";
			Запрос.Параметры.Вставить("ГрафикРаботы", Выборка.Ссылка); 
			
			ВыборкаЗапроса =  Запрос.Выполнить().Выбрать();
			
			ТипОбъекта	= ТУРВ_ОбменДаннымиПовтИсп.ТипыОбъектов().РСНЗ;
			ИмяОбъекта = "ГрафикиРаботыПоВидамВремени";
			
			
			Пока ВыборкаЗапроса.Следующий() Цикл 
				
				Структура = Новый Структура;
				Структура.Вставить("ГрафикРаботы",     Выборка.Ссылка);
				Структура.Вставить("Месяц",            ВыборкаЗапроса.Месяц);
				
				ДанныеJSON = ТУРВ_РаботаСJSONСервер.ЗаписьJSON(Структура);	
				
				ХешированиеДанных  = Новый ХешированиеДанных (ХешФункция.CRC32);
				ХешированиеДанных.Добавить(ДанныеJSON);
				ХешСумма = ХешированиеДанных.ХешСумма;
				
				РегистрыСведений.ТУРВ_ОчередьОбменаПроизвольнымиДанными.ЗарегистрироватьДобавлениеОбъекта(ТипОбъекта, ИмяОбъекта, ХешСумма, ДанныеJSON);
				
			КонецЦикла;
			
		КонецЦикла;	
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	Организации.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Организации КАК Организации";
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			ТУРВ_ОбработкаСобытийСервер.ЗарегистрироватьЗаписьСсылочногоОбъекта(Выборка.Ссылка, Истина);
		КонецЦикла;
		
		Запрос.Текст = "ВЫБРАТЬ
		|	ПодразделенияОрганизаций.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ПодразделенияОрганизаций КАК ПодразделенияОрганизаций";
		
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			ТУРВ_ОбработкаСобытийСервер.ЗарегистрироватьЗаписьСсылочногоОбъекта(Выборка.Ссылка, Истина);
		КонецЦикла;
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	Должности.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Должности КАК Должности";
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			ТУРВ_ОбработкаСобытийСервер.ЗарегистрироватьЗаписьСсылочногоОбъекта(Выборка.Ссылка, Истина);
		КонецЦикла;
		
	КонецЕсли;	
	
КонецПроцедуры	

#КонецОбласти
