#Область ПрограммныйИнтерфейс

Функция НастройкиСервиса() Экспорт 
	
	СтруктураВозврата = ТУРВ_РаботаСФункциямиКлиентСервер.СтруктураВозврата();
	СтруктураРезультата = Новый Структура("АдресСервера, ЛогинПользователя, ПарольПользователя, ИДБазы, УровеньЛогирования");
	
	ВыборкаЗаписей = РегистрыСведений.ТУРВ_НастройкиСервиса.Выбрать();
	Если ВыборкаЗаписей.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(СтруктураРезультата, ВыборкаЗаписей);
	Иначе 
		ТУРВ_РаботаСФункциямиКлиентСервер.ДобавитьОшибку(СтруктураВозврата, "Не найдены настройки сервиса");
	КонецЕсли;	
	
	ТУРВ_РаботаСФункциямиКлиентСервер.ДобавитьРезультат(СтруктураВозврата, СтруктураРезультата);
	
	Возврат СтруктураВозврата;
	
КонецФункции	

#КонецОбласти
