#Область ПрограммныйИнтерфейс

Функция Логин(НастройкиСервиса) Экспорт
	
	РесурсНаСервере = "/api/auth/login";	
	Токен = "";
		
    СтруктураВозврата = СоздатьСоединение(НастройкиСервиса, "");
	Если ТУРВ_РаботаСФункциямиКлиентСервер.Ошибка(СтруктураВозврата) Тогда
		Возврат СтруктураВозврата;
	КонецЕсли;
	Соединение = ТУРВ_РаботаСФункциямиКлиентСервер.Результат(СтруктураВозврата);
	
	ИД = Строка(Новый УникальныйИдентификатор());
	HTTPЗапрос = Новый HTTPЗапрос(РесурсНаСервере);
	
	ТелоЗапроса = СтрШаблон("{""email"": ""%1"", ""password"": ""%2"", ""id"": ""%3""}", 
							НастройкиСервиса.ЛогинПользователя, 
							НастройкиСервиса.ПарольПользователя, 
							ИД);
							
	HTTPЗапрос.УстановитьТелоИзСтроки(ТелоЗапроса);
	HTTPЗапрос.Заголовки.Вставить("Content-type", "application/json; charset=utf-8");
		
    СтруктураОтвета = ОтправитьЗапрос(	РесурсНаСервере, 
										Соединение, 
										ИД, 
										ТУРВ_ОбменДаннымиПовтИсп.МетодыЗапроса().ПОСТ, 
										HTTPЗапрос,  
										"ТУРБ_ОбменДанными.Логин.ОписаниеЗапроса",
										"token");
										

	Возврат СтруктураОтвета;
	
КонецФункции

Процедура ВыполнитьОбмен(СообщатьОбОшибках = Истина) Экспорт  
	
	НастройкиСервисаСтруктура = ТУРВ_ОбменДаннымиПовтИсп.НастройкиСервиса();
	Если ТУРВ_РаботаСФункциямиКлиентСервер.Ошибка(НастройкиСервисаСтруктура) Тогда
		Если СообщатьОбОшибках Тогда
			ТУРВ_РаботаСФункциямиКлиентСервер.СообщитьОбОшибках(НастройкиСервисаСтруктура);
		КонецЕсли;			
		Возврат;
	КонецЕсли;
	НастройкиСервиса = ТУРВ_РаботаСФункциямиКлиентСервер.Результат(НастройкиСервисаСтруктура);
	
	ТокенСтруктура = ТУРВ_ОбменДаннымиСервер.Логин(НастройкиСервиса); 
	Если ТУРВ_РаботаСФункциямиКлиентСервер.Ошибка(ТокенСтруктура) Тогда
		Если СообщатьОбОшибках Тогда
			ТУРВ_РаботаСФункциямиКлиентСервер.СообщитьОбОшибках(ТокенСтруктура);
		КонецЕсли;	
		Возврат;
	КонецЕсли;
	Токен = ТУРВ_РаботаСФункциямиКлиентСервер.Результат(ТокенСтруктура);
	
	РезультатОбмена = ТУРВ_РаботаСФункциямиКлиентСервер.СтруктураВозврата();
	
	ТУРВ_ЛогированиеСервер.ДобавитьЗаписьВЛог(	ТУРВ_ОбменДаннымиПовтИсп.УровниЛога().Дебаг, 
										ТУРВ_ОбменДаннымиПовтИсп.СобытияЛога().НачатПолныйОбмен, 
										ТУРВ_ОбменДаннымиПовтИсп.УровниСобытийЛога().Информация,
										ТУРВ_ЛогированиеСервер.ДанныеJSONОбъектСтрока(	ТУРВ_ОбменДаннымиПовтИсп.УровниЛога().Дебаг, 
																				ТУРВ_ЛогированиеСервер.ТекущаяДатаЛК(), 
																				"",
																				ТУРВ_ОбменДаннымиПовтИсп.ТипыОбъектов().Строка, 
																				""
																				"", 
																				"ТУРБ_ОбменДанными.ВыполнитьОбмен",));
	
	
	РезультатОбменСсылочнымиДанными = ВыполнитьОбменСсылочнымиДанными(НастройкиСервиса, Токен);
	ТУРВ_РаботаСФункциямиКлиентСервер.ОбъединитьОшибки(РезультатОбмена, РезультатОбменСсылочнымиДанными);
	
	РезультатОбменПроизвольнымиДанными = ВыполнитьОбменПроизвольнымиДанными(НастройкиСервиса, Токен);
	ТУРВ_РаботаСФункциямиКлиентСервер.ОбъединитьОшибки(РезультатОбмена, РезультатОбменПроизвольнымиДанными);
	
	РезультатПолученияДанных = ВыполнитьПолучениеДанных(НастройкиСервиса, Токен);
	ТУРВ_РаботаСФункциямиКлиентСервер.ОбъединитьОшибки(РезультатОбмена, РезультатПолученияДанных);
	
	Если СообщатьОбОшибках И ТУРВ_РаботаСФункциямиКлиентСервер.Ошибка(РезультатОбмена) Тогда
		ТУРВ_РаботаСФункциямиКлиентСервер.СообщитьОбОшибках(РезультатОбмена);
	ИначеЕсли СообщатьОбОшибках Тогда
		
		Сообщение = Новый  СообщениеПользователю;
		Сообщение.Текст = "Обмен выполнен";
		Сообщение.Сообщить();
		
	КонецЕсли;	
	
	ТУРВ_ЛогированиеСервер.ДобавитьЗаписьВЛог(	ТУРВ_ОбменДаннымиПовтИсп.УровниЛога().Дебаг, 
										ТУРВ_ОбменДаннымиПовтИсп.СобытияЛога().ЗавершенПолныйОбмен, 
										ТУРВ_ОбменДаннымиПовтИсп.УровниСобытийЛога().Информация,
										ТУРВ_ЛогированиеСервер.ДанныеJSONОбъектСтрока(	ТУРВ_ОбменДаннымиПовтИсп.УровниЛога().Дебаг, 
																				ТУРВ_ЛогированиеСервер.ТекущаяДатаЛК(),
																				,
																				ТУРВ_ОбменДаннымиПовтИсп.ТипыОбъектов().Строка, 
																				"", 
																				"",
																				"ТУРБ_ОбменДанными.ВыполнитьОбмен",));

	
КонецПроцедуры

Функция ВыполнитьОбменСсылочнымиДанными(НастройкиСервиса, Токен)
	
	СтруктураВозврата = ТУРВ_РаботаСФункциямиКлиентСервер.СтруктураВозврата();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ТУРБ_ОчередьОбменаСЛКСсылочнымиДанными.Объект КАК Объект,
	               |	ТУРБ_ОчередьОбменаСЛКСсылочнымиДанными.ВидСобытия КАК ВидСобытия
	               |ИЗ
	               |	РегистрСведений.ТУРБ_ОчередьОбменаСЛКСсылочнымиДанными КАК ТУРБ_ОчередьОбменаСЛКСсылочнымиДанными
	               |ГДЕ
	               |	ТУРБ_ОчередьОбменаСЛКСсылочнымиДанными.Статус <> ЗНАЧЕНИЕ(Перечисление.ТУРБ_СтатусОбменаСЛК.Выполнен)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ВидСобытия,
	               |	Объект";   
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл	
			
		ИД = Строка(Новый УникальныйИдентификатор());
		ИмяМетаданных = Выборка.Объект.Метаданные().Имя;	
		Объект = СтрШаблон(	"{name: ""%1"", object: ""%2""}", 
							ИмяМетаданных, 
							Строка(Выборка.Объект.УникальныйИдентификатор()));
		
		ТУРВ_ЛогированиеСервер.ДобавитьЗаписьВЛог(	ТУРВ_ОбменДаннымиПовтИсп.УровниЛога().Дебаг, 
											ТУРВ_ОбменДаннымиПовтИсп.СобытияЛога().НачатаОбработкаЗадания, 
											ТУРВ_ОбменДаннымиПовтИсп.УровниСобытийЛога().Информация,
											ТУРВ_ЛогированиеСервер.ДанныеJSONОбъектJSON(ТУРВ_ОбменДаннымиПовтИсп.УровниЛога().Дебаг, 
																				ТУРВ_ЛогированиеСервер.ТекущаяДатаЛК(),
																				ИД,
																				ТУРВ_ОбменДаннымиПовтИсп.ТипыОбъектов().СпрС,
																				ИмяМетаданных, 
																				Объект, 
																				"ТУРБ_ОбменДанными.ВыполнитьОбменСсылочнымиДанными"));
		
		
		Если ТипЗнч(Выборка.Объект) = Тип("СправочникСсылка.Организации") Тогда
			
			Если Выборка.ВидСобытия = Перечисления.ТУРВ_ВидыСобытийСОбъектамиЛК.Добавление Тогда
				Результат = ТУРВ_ОбменДаннымиСервер.ДобавитьОрганизацию(НастройкиСервиса, Токен, ИД, Выборка.Объект);
			ИначеЕсли Выборка.ВидСобытия = Перечисления.ТУРВ_ВидыСобытийСОбъектамиЛК.Изменение Тогда
				Результат = ТУРВ_ОбменДаннымиСервер.ОбновитьОрганизацию(НастройкиСервиса, Токен, ИД, Выборка.Объект);		
			КонецЕсли;	
			
		ИначеЕсли ТипЗнч(Выборка.Объект) = Тип("СправочникСсылка.ПодразделенияОрганизаций") Тогда
			
			Если Выборка.ВидСобытия = Перечисления.ТУРВ_ВидыСобытийСОбъектамиЛК.Добавление Тогда
				Результат = ТУРВ_ОбменДаннымиСервер.ДобавитьПодразделение(НастройкиСервиса, Токен, ИД, Выборка.Объект);
			ИначеЕсли Выборка.ВидСобытия = Перечисления.ТУРВ_ВидыСобытийСОбъектамиЛК.Изменение Тогда
				Результат = ТУРВ_ОбменДаннымиСервер.ОбновитьПодразделение(НастройкиСервиса, Токен, ИД, Выборка.Объект);		
			КонецЕсли;	
			
		ИначеЕсли ТипЗнч(Выборка.Объект) = Тип("СправочникСсылка.Должности") Тогда
			
			Если Выборка.ВидСобытия = Перечисления.ТУРВ_ВидыСобытийСОбъектамиЛК.Добавление Тогда
				Результат = ТУРВ_ОбменДаннымиСервер.ДобавитьДолжность(НастройкиСервиса, Токен, ИД, Выборка.Объект);
			ИначеЕсли Выборка.ВидСобытия = Перечисления.ТУРВ_ВидыСобытийСОбъектамиЛК.Изменение Тогда
				Результат = ТУРВ_ОбменДаннымиСервер.ОбновитьДолжность(НастройкиСервиса, Токен, ИД, Выборка.Объект);		
			КонецЕсли;
			
		ИначеЕсли ТипЗнч(Выборка.Объект) = Тип("СправочникСсылка.ВидыИспользованияРабочегоВремени") Тогда
			
			Если Выборка.ВидСобытия = Перечисления.ТУРВ_ВидыСобытийСОбъектамиЛК.Добавление Тогда
				Результат = ТУРВ_ОбменДаннымиСервер.ДобавитьВидИспользованияРабочегоВремени(НастройкиСервиса, Токен, ИД, Выборка.Объект);
			ИначеЕсли Выборка.ВидСобытия = Перечисления.ТУРВ_ВидыСобытийСОбъектамиЛК.Изменение Тогда
				Результат = ТУРВ_ОбменДаннымиСервер.ОбновитьВидИспользованияРабочегоВремени(НастройкиСервиса, Токен, ИД, Выборка.Объект);		
			КонецЕсли;
			
		ИначеЕсли ТипЗнч(Выборка.Объект) = Тип("СправочникСсылка.ГрафикиРаботыСотрудников") Тогда
			
			Если Выборка.ВидСобытия = Перечисления.ТУРВ_ВидыСобытийСОбъектамиЛК.Добавление Тогда
				Результат = ТУРВ_ОбменДаннымиСервер.ДобавитьГрафикРаботы(НастройкиСервиса, Токен, ИД, Выборка.Объект);
			ИначеЕсли Выборка.ВидСобытия = Перечисления.ТУРВ_ВидыСобытийСОбъектамиЛК.Изменение Тогда
				Результат = ТУРВ_ОбменДаннымиСервер.ОбновитьГрафикРаботы(НастройкиСервиса, Токен, ИД, Выборка.Объект);		
			КонецЕсли;
			
		КонецЕсли;
		
		Если Результат <> Неопределено И Не ТУРВ_РаботаСФункциямиКлиентСервер.Ошибка(Результат) Тогда
			РегистрыСведений.ТУРВ_ОчередьОбменаСсылочнымиДанными.ЗарегистрироватьУспехОбработки(ИД, Выборка.Объект, Выборка.ВидСобытия);
		ИначеЕсли Результат <> Неопределено  Тогда
			
			РегистрыСведений.ТУРВ_ОчередьОбменаСсылочнымиДанными.ЗарегистрироватьОшибкуОбработки(ИД, Выборка.Объект, Выборка.ВидСобытия, 
																								  "ТУРБ_ОбменДанными.ВыполнитьОбменСсылочнымиДанными",
																								  ТУРВ_РаботаСФункциямиКлиентСервер.ОшибкиСтрокой(Результат));
			ТУРВ_РаботаСФункциямиКлиентСервер.ОбъединитьОшибки(СтруктураВозврата, Результат); 
			
		КонецЕсли;
		
		ТУРВ_ЛогированиеСервер.ДобавитьЗаписьВЛог(	ТУРВ_ОбменДаннымиПовтИсп.УровниЛога().Дебаг, 
											ТУРВ_ОбменДаннымиПовтИсп.СобытияЛога().ЗавершенаОбработкаЗадания, 
											ТУРВ_ОбменДаннымиПовтИсп.УровниСобытийЛога().Информация,
											ТУРВ_ЛогированиеСервер.ДанныеJSONОбъектJSON(ТУРВ_ОбменДаннымиПовтИсп.УровниЛога().Дебаг, 
																				ТУРВ_ЛогированиеСервер.ТекущаяДатаЛК(),
																				ИД,
																				ТУРВ_ОбменДаннымиПовтИсп.ТипыОбъектов().СпрС, 
																				ИмяМетаданных,
																				Объект, 
																				"ТУРБ_ОбменДанными.ВыполнитьОбменСсылочнымиДанными"));

		
	КонецЦикла;
	
	Возврат СтруктураВозврата;
	
КонецФункции	

Функция ВыполнитьОбменПроизвольнымиДанными(НастройкиСервиса, Токен)
	
	СтруктураВозврата = ТУРВ_РаботаСФункциямиКлиентСервер.СтруктураВозврата();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
					|	ТУРБ_ОчередьОбменаСЛКПроизвольнымиДанными.ТипОбъкта КАК ТипОбъкта,
					|	ТУРБ_ОчередьОбменаСЛКПроизвольнымиДанными.ИмяОбъекта КАК ИмяОбъекта,
					|	ТУРБ_ОчередьОбменаСЛКПроизвольнымиДанными.ВидСобытия КАК ВидСобытия,
					|	ТУРБ_ОчередьОбменаСЛКПроизвольнымиДанными.ХЭШ КАК ХЭШ,
					|	ТУРБ_ОчередьОбменаСЛКПроизвольнымиДанными.Данные КАК Данные,
					|	ТУРБ_ОчередьОбменаСЛКПроизвольнымиДанными.ДатаСобытия КАК ДатаСобытия
					|ИЗ
					|	РегистрСведений.ТУРБ_ОчередьОбменаСЛКПроизвольнымиДанными КАК ТУРБ_ОчередьОбменаСЛКПроизвольнымиДанными
					|ГДЕ
					|	ТУРБ_ОчередьОбменаСЛКПроизвольнымиДанными.Статус <> ЗНАЧЕНИЕ(Перечисление.ТУРБ_СтатусОбменаСЛК.Выполнен)
					|
					|УПОРЯДОЧИТЬ ПО
					|	ДатаСобытия,
					|	ИмяОбъекта,
					|	ВидСобытия,
					|	ТипОбъкта,
					|	ХЭШ";   
	                                   
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		ИД = Строка(Новый УникальныйИдентификатор());
		
		ТУРВ_ЛогированиеСервер.ДобавитьЗаписьВЛог(	ТУРВ_ОбменДаннымиПовтИсп.УровниЛога().Дебаг, 
											ТУРВ_ОбменДаннымиПовтИсп.СобытияЛога().НачатаОбработкаЗадания, 
											ТУРВ_ОбменДаннымиПовтИсп.УровниСобытийЛога().Информация,
											ТУРВ_ЛогированиеСервер.ДанныеJSONОбъектJSON(ТУРВ_ОбменДаннымиПовтИсп.УровниЛога().Дебаг, 
																				ТУРВ_ЛогированиеСервер.ТекущаяДатаЛК(),
																				ИД,
																				Выборка.ТипОбъкта,
																				Выборка.ИмяОбъекта, 
																				Выборка.Данные, 
																				"ТУРБ_ОбменДанными.ВыполнитьОбменПроизвольнымиДанными"));

		Если Выборка.ТипОбъкта = ТУРВ_ОбменДаннымиПовтИсп.ТипыОбъектов().РСНЗ Тогда
			Если Выборка.ИмяОбъекта = "ФотографииФизическихЛиц" Тогда
				
				ДанныеСтрутура = ТУРВ_РаботаСJSONСервер.ПрочитатьJSON_АП(Выборка.Данные);
				СоответствиеФизЛиц = ТУРВ_РаботаСJSONСервер.ЧтениеJSON(ДанныеСтрутура["Объект"]);
				Для Каждого Запись Из СоответствиеФизЛиц Цикл 
					
					ФизическоеЛицоСсылка = Запись.Ключ;
					Результат = ТУРВ_ОбменДаннымиСервер.ОбновитьФотоПользователя(НастройкиСервиса, Токен, ИД, ФизическоеЛицоСсылка); 
					
				КонецЦикла;
				
			ИначеЕсли Выборка.ИмяОбъекта = "ГрафикиРаботыПоВидамВремени" Тогда
				
				ДанныеСтрутура = ТУРВ_РаботаСJSONСервер.ЧтениеJSON(Выборка.Данные);
				ГрафикРаботыСсылка = ДанныеСтрутура.ГрафикРаботы;
				Месяц = ДанныеСтрутура.Месяц;
				Результат = ТУРВ_ОбменДаннымиСервер.ОбновитьГрафикиРаботыПоВидамВремения(НастройкиСервиса, Токен, ИД, ГрафикРаботыСсылка, Месяц); 
	
			ИначеЕсли Выборка.ИмяОбъекта = "КадроваяИсторияСотрудников" Тогда
				
				Если Выборка.ВидСобытия = Перечисления.ТУРВ_ВидыСобытийСОбъектамиЛК.Добавление Тогда
					
					ДанныеСтрутура = ТУРВ_РаботаСJSONСервер.ЧтениеJSON(Выборка.Данные);
					СотрудникСсылка      = ДанныеСтрутура.Сотрудник;
					ФизическоеЛицоСсылка = ДанныеСтрутура.ФизическоеЛицо;
					
					ЗапросКадровойИстории = Новый Запрос;
					ЗапросКадровойИстории.Текст = "ВЫБРАТЬ
													|	КадроваяИсторияСотрудниковИнтервальный.ДатаНачала КАК ДатаНачала,
													|	КадроваяИсторияСотрудниковИнтервальный.Должность КАК Должность,
													|	КадроваяИсторияСотрудниковИнтервальный.Подразделение КАК Подразделение
													|ИЗ
													|	РегистрСведений.КадроваяИсторияСотрудниковИнтервальный КАК КадроваяИсторияСотрудниковИнтервальный
													|ГДЕ
													|	КадроваяИсторияСотрудниковИнтервальный.Сотрудник = &Сотрудник";
					ЗапросКадровойИстории.УстановитьПараметр("Сотрудник", СотрудникСсылка);
					
					СтруктураРабочихМест = Новый Структура;
					МассивРабочихМест = Новый Массив;
					
					ВыборкаКадровойИстории = ЗапросКадровойИстории.Выполнить().Выбрать();
					Пока ВыборкаКадровойИстории.Следующий() Цикл
						СтруктураРабочегоМеста = Новый Структура;
						СтруктураРабочегоМеста.Вставить("position_pk",    ВыборкаКадровойИстории.Должность);
						СтруктураРабочегоМеста.Вставить("subdivision_pk", ВыборкаКадровойИстории.Подразделение);
						СтруктураРабочегоМеста.Вставить("date_from",      ВыборкаКадровойИстории.ДатаНачала);
						МассивРабочихМест.Добавить(СтруктураРабочегоМеста);
					КонецЦикла;
					
					Результат = ТУРВ_ОбменДаннымиСервер.СоздатьОбновитьКадровойИсториюСотрудника(ИД, НастройкиСервиса, Токен, СотрудникСсылка, МассивРабочихМест);
					
				КонецЕсли;
				
			ИначеЕсли Выборка.ИмяОбъекта = "ГрафикРаботыСотрудников" Тогда	
				
				СтруктураДанных = ТУРВ_РаботаСJSONСервер.ЧтениеJSON(Выборка.Данные);
				Сотрудник = СтруктураДанных.Сотрудник;
				Период = СтруктураДанных.Период;
				Результат = ТУРВ_ОбменДаннымиСервер.ОбновитьДанныеОГрафикахСотрудников(НастройкиСервиса, Токен, ИД, Сотрудник, Период); 
				
			КонецЕсли;
						
			ДанныеСтрутура = ТУРВ_РаботаСJSONСервер.ЧтениеJSON(Выборка.Данные);	
			
		ИначеЕсли Выборка.ИмяОбъекта = "ДанныеИндивидуальныхГрафиковСотрудников" Тогда	
			
			ДанныеСтрутура = ТУРВ_РаботаСJSONСервер.ЧтениеJSON(Выборка.Данные);
			СотрудникСсылка = ДанныеСтрутура.Сотрудник;
			Дата 	  		= ДанныеСтрутура.Период;
			Результат = ТУРВ_ОбменДаннымиСервер.ОбновитьДанныеИндивидуальныхГрафиковСотрудников(НастройкиСервиса, Токен, ИД, СотрудникСсылка, Дата); 	
			
		ИначеЕсли Выборка.ТипОбъкта = ТУРВ_ОбменДаннымиПовтИсп.ТипыОбъектов().ПодтвОбм Тогда
			
			Данные = ТУРВ_РаботаСJSONСервер.ПрочитатьJSON_АП(Выборка.Данные);
			Ключ      = Данные.Получить("Ключ");
			Результат = ТУРВ_ОбменДаннымиСервер.ПодтвердитьПолучениеДанных(НастройкиСервиса, Токен, ИД, Ключ); 
			
		КонецЕсли;
		                                                                   
		Если Результат <> Неопределено И Не ТУРВ_РаботаСФункциямиКлиентСервер.Ошибка(Результат) Тогда
			РегистрыСведений.ТУРВ_ОчередьОбменаПроизвольнымиДанными.ЗарегистрироватьУспехОбработки(ИД, 
																									Выборка.ТипОбъкта, 
																									Выборка.ИмяОбъекта, 
																									Выборка.ВидСобытия, 
																									Выборка.ХЭШ, 
																									Выборка.Данные);
		ИначеЕсли Результат <> Неопределено  Тогда

			РегистрыСведений.ТУРВ_ОчередьОбменаПроизвольнымиДанными.ЗарегистрироватьОшибкуОбработки(ИД, 
																									Выборка.ТипОбъкта, 
																									Выборка.ИмяОбъекта, 
																									Выборка.ВидСобытия, 
																									Выборка.ХЭШ, 
																									Выборка.Данные, 
																									"ТУРБ_ОбменДанными.ВыполнитьОбменПроизвольнымиДанными",
																									ТУРВ_РаботаСФункциямиКлиентСервер.ОшибкиСтрокой(Результат));
			ТУРВ_РаботаСФункциямиКлиентСервер.ОбъединитьОшибки(СтруктураВозврата, Результат); 
			
		КонецЕсли;
		
		ТУРВ_ЛогированиеСервер.ДобавитьЗаписьВЛог(	ТУРВ_ОбменДаннымиПовтИсп.УровниЛога().Дебаг, 
											ТУРВ_ОбменДаннымиПовтИсп.СобытияЛога().ЗавершенаОбработкаЗадания, 
											ТУРВ_ОбменДаннымиПовтИсп.УровниСобытийЛога().Информация,
											ТУРВ_ЛогированиеСервер.ДанныеJSONОбъектJSON(ТУРВ_ОбменДаннымиПовтИсп.УровниЛога().Дебаг, 
																				ТУРВ_ЛогированиеСервер.ТекущаяДатаЛК(),
																				ИД,
																				Выборка.ТипОбъкта,
																				Выборка.ИмяОбъекта, 
																				Выборка.Данные, 
																				"ТУРБ_ОбменДанными.ВыполнитьОбменПроизвольнымиДанными"));

	КонецЦикла;
	
	Возврат СтруктураВозврата;
	
КонецФункции	

Функция ВыполнитьПолучениеДанных(НастройкиСервиса, Токен)
	
	СтруктураВозврата = ТУРВ_РаботаСФункциямиКлиентСервер.СтруктураВозврата();
	
	РесурсНаСервере = "/api/exchange" + "?base_pk=" + НастройкиСервиса.ИДБазы; 

    СтруктураВозврата = СоздатьСоединение(НастройкиСервиса, 0);
	Если ТУРВ_РаботаСФункциямиКлиентСервер.Ошибка(СтруктураВозврата) Тогда
		Возврат СтруктураВозврата;
	КонецЕсли;
	Соединение = ТУРВ_РаботаСФункциямиКлиентСервер.Результат(СтруктураВозврата);
	
	HTTPЗапрос = Новый HTTPЗапрос(РесурсНаСервере);
	HTTPЗапрос.Заголовки.Вставить("Content-type", "application/json; charset=utf-8");
	HTTPЗапрос.Заголовки.Вставить("Authorization", Токен);
	
	СтруктураОтвета = ОтправитьЗапрос(	РесурсНаСервере, 
										Соединение, 
										0, 
										ТУРВ_ОбменДаннымиПовтИсп.МетодыЗапроса().ГЕТ, 
										HTTPЗапрос,  
										"ТУРБ_ОбменДанными.ВыполнитьПолучениеДанных.ОписаниеЗапроса",
										"data");
	
	                                   
	Если ТУРВ_РаботаСФункциямиКлиентСервер.Ошибка(СтруктураОтвета) Тогда
		Возврат СтруктураОтвета;
	КонецЕсли;
	
	МассивОбъектов = ТУРВ_РаботаСФункциямиКлиентСервер.Результат(СтруктураОтвета);
	
	Для Каждого ОбъектОбмена Из МассивОбъектов Цикл
		
		ИД = Строка(Новый УникальныйИдентификатор());
		
		КлючОбъекта = ОбъектОбмена.Получить("pk");
		Данные      = ОбъектОбмена.Получить("ex_data");
		ВидОбъекта  = ОбъектОбмена.Получить("ex_type");
		КлючСобытия = ОбъектОбмена.Получить("event_pk");
		
		ТУРВ_ЛогированиеСервер.ДобавитьЗаписьВЛог(	ТУРВ_ОбменДаннымиПовтИсп.УровниЛога().Дебаг, 
											ТУРВ_ОбменДаннымиПовтИсп.СобытияЛога().НачалоОбработкиПолученихДанных, 
											ТУРВ_ОбменДаннымиПовтИсп.УровниСобытийЛога().Информация,
											ТУРВ_ЛогированиеСервер.ДанныеJSONОбъектJSON(ТУРВ_ОбменДаннымиПовтИсп.УровниЛога().Дебаг, 
																				ТУРВ_ЛогированиеСервер.ТекущаяДатаЛК(),
																				ИД,
																				ТУРВ_ОбменДаннымиПовтИсп.ТипыОбъектов().ОБМ,
																				ВидОбъекта,
																				Данные, 
																				"ТУРБ_ОбменДанными.ВыполнитьПолучениеДанных"));

		Если ВидОбъекта = ТУРВ_ОбменДаннымиПовтИсп.ВидыОбъектов().Табель Тогда
			
			ДанныеСтрутура = ТУРВ_РаботаСJSONСервер.ПрочитатьJSON_ISO(Данные, "doc_date");
			
		КонецЕсли;	
		
		ТУРВ_ЛогированиеСервер.ДобавитьЗаписьВЛог(	ТУРВ_ОбменДаннымиПовтИсп.УровниЛога().Дебаг, 
											ТУРВ_ОбменДаннымиПовтИсп.СобытияЛога().ЗавершенаОбработкаЗадания, 
											ТУРВ_ОбменДаннымиПовтИсп.УровниСобытийЛога().Информация,
											ТУРВ_ЛогированиеСервер.ДанныеJSONОбъектJSON(ТУРВ_ОбменДаннымиПовтИсп.УровниЛога().Дебаг, 
																				ТУРВ_ЛогированиеСервер.ТекущаяДатаЛК(),
																				ИД,
																				ТУРВ_ОбменДаннымиПовтИсп.ТипыОбъектов().ОБМ,
																				ВидОбъекта,
																				Данные, 
																				"ТУРБ_ОбменДанными.ЗавершениеОбработкиПолученихДанных"));


	КонецЦикла;
	
	Возврат СтруктураВозврата;
	
КонецФункции

Функция ПодтвердитьПолучениеДанных(НастройкиСервиса, Токен, ИД, Ключ) Экспорт 
	
	РесурсНаСервере = "/api/exchange"; 

    СтруктураВозврата = СоздатьСоединение(НастройкиСервиса, ИД);
	Если ТУРВ_РаботаСФункциямиКлиентСервер.Ошибка(СтруктураВозврата) Тогда
		Возврат СтруктураВозврата;
	КонецЕсли;
	Соединение = ТУРВ_РаботаСФункциямиКлиентСервер.Результат(СтруктураВозврата);
	
	HTTPЗапрос = Новый HTTPЗапрос(РесурсНаСервере);
	HTTPЗапрос.Заголовки.Вставить("Content-type", "application/json; charset=utf-8");
	HTTPЗапрос.Заголовки.Вставить("Authorization", Токен);
	
	Структура = Новый Структура;
	Структура.Вставить("pk", Ключ);
	МассивОбъектов = Новый Массив;
	МассивОбъектов.Добавить(Структура);
		
	ТелоЗапроса = ТУРВ_РаботаСJSONСервер.ЗаписатьJSON_АП(МассивОбъектов);
	
	HTTPЗапрос.УстановитьТелоИзСтроки(ТелоЗапроса);
	
	СтруктураОтвета = ОтправитьЗапрос(	РесурсНаСервере, 
										Соединение, 
										ИД, 
										ТУРВ_ОбменДаннымиПовтИсп.МетодыЗапроса().ПОСТ, 
										HTTPЗапрос,  
										"ТУРБ_ОбменДанными.ДобавитьОбновитьОрганизацию.ПодтвердитьПолучениеДанных",
										"");	
	Возврат СтруктураОтвета;	
	
КонецФункции

#Область НСИ

#Область Организации

Функция ДобавитьОрганизацию(НастройкиСервиса, Токен, ИД, ОрганизацияСсылка) Экспорт
	
	Возврат ДобавитьОбновитьОрганизацию(НастройкиСервиса, Токен, ИД, ОрганизацияСсылка);
	
КонецФункции

Функция ОбновитьОрганизацию(НастройкиСервиса, Токен, ИД, ОрганизацияСсылка) Экспорт
	
	Возврат ДобавитьОбновитьОрганизацию(НастройкиСервиса, Токен, ИД, ОрганизацияСсылка);
	
КонецФункции

#КонецОбласти

#Область Подразделения

Функция ДобавитьПодразделение(НастройкиСервиса, Токен, ИД, ПодразделениеСсылка) Экспорт
	
	Возврат ДобавитьОбновитьПодразделение(НастройкиСервиса, Токен, ИД, ПодразделениеСсылка);
	
КонецФункции

Функция ОбновитьПодразделение(НастройкиСервиса, Токен, ИД, ПодразделениеСсылка) Экспорт
	
	Возврат ДобавитьОбновитьПодразделение(НастройкиСервиса, Токен, ИД, ПодразделениеСсылка);
	
КонецФункции

#КонецОбласти

#Область Должности

Функция ДобавитьДолжность(НастройкиСервиса, Токен, ИД, ДолжностьСсылка) Экспорт 
	
	РесурсНаСервере = "/api/common/employee-position"; 
	
	СтруктураВозврата = СоздатьСоединение(НастройкиСервиса, ИД);
	Если ТУРВ_РаботаСФункциямиКлиентСервер.Ошибка(СтруктураВозврата) Тогда
		Возврат СтруктураВозврата;
	КонецЕсли;
	Соединение = ТУРВ_РаботаСФункциямиКлиентСервер.Результат(СтруктураВозврата);

	НаименованиеДолжности = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДолжностьСсылка, "Наименование");
	
	Структура = Новый Структура;
	Структура.Вставить("position_name", НаименованиеДолжности);
	Структура.Вставить("base_pk",    	НастройкиСервиса.ИДБазы);
	Структура.Вставить("pk",            ДолжностьСсылка);
	ТелоЗапроса = ТУРВ_РаботаСJSONСервер.ЗаписатьJSON_АП(Структура);
	
	HTTPЗапрос = Новый HTTPЗапрос(РесурсНаСервере);
	HTTPЗапрос.УстановитьТелоИзСтроки(ТелоЗапроса);
	HTTPЗапрос.Заголовки.Вставить("Content-type",  "application/json; charset=utf-8");
	HTTPЗапрос.Заголовки.Вставить("Authorization", Токен);
	HTTPЗапрос.Заголовки.Вставить("ID",            ИД);

	СтруктураОтвета = ОтправитьЗапрос(	РесурсНаСервере, 
										Соединение, 
										ИД, 
										ТУРВ_ОбменДаннымиПовтИсп.МетодыЗапроса().ПОСТ, 
										HTTPЗапрос,  
										"ТУРБ_ОбменДанными.ДобавитьОбновитьОрганизацию.ОписаниеЗапроса",
										"pk");
	
		
	
	Возврат СтруктураОтвета;	
	
КонецФункции	

Функция ОбновитьДолжность(НастройкиСервиса, Токен, ИД, ДолжностьСсылка) Экспорт 
	
	РесурсНаСервере = "/api/common/employee-position"; 
	
	СтруктураВозврата = СоздатьСоединение(НастройкиСервиса, ИД);
	Если ТУРВ_РаботаСФункциямиКлиентСервер.Ошибка(СтруктураВозврата) Тогда
		Возврат СтруктураВозврата;
	КонецЕсли;
	Соединение = ТУРВ_РаботаСФункциямиКлиентСервер.Результат(СтруктураВозврата);
		
	НаименованиеДолжности = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДолжностьСсылка, "Наименование");
	
	Структура = Новый Структура;
	Структура.Вставить("position_name", НаименованиеДолжности);
	Структура.Вставить("base_pk",    	НастройкиСервиса.ИДБазы);
	Структура.Вставить("pk",            ДолжностьСсылка);
	ТелоЗапроса = ТУРВ_РаботаСJSONСервер.ЗаписатьJSON_АП(Структура);
	
	HTTPЗапрос = Новый HTTPЗапрос(РесурсНаСервере);		
	HTTPЗапрос.УстановитьТелоИзСтроки(ТелоЗапроса);
	HTTPЗапрос.Заголовки.Вставить("Content-type",  "application/json; charset=utf-8");
	HTTPЗапрос.Заголовки.Вставить("Authorization", Токен);
	HTTPЗапрос.Заголовки.Вставить("ID",            ИД);
	
	СтруктураОтвета = ОтправитьЗапрос(	РесурсНаСервере, 
										Соединение, 
										ИД, 
										ТУРВ_ОбменДаннымиПовтИсп.МетодыЗапроса().ПУТ, 
										HTTPЗапрос,  
										"ТУРБ_ОбменДанными.ДобавитьОбновитьОрганизацию.ОписаниеЗапроса",
										"pk");		
	
	Возврат СтруктураОтвета;	
	
КонецФункции

#КонецОбласти

#Область ВидыИспользованияРабочегоВремени

Функция ДобавитьВидИспользованияРабочегоВремени(НастройкиСервиса, Токен, ИД, ВидИспользованияРабочегоВремениСсылка) Экспорт 
	
	РесурсНаСервере = "/api/common/type-of-time"; 

    СтруктураВозврата = СоздатьСоединение(НастройкиСервиса, ИД);
	Если ТУРВ_РаботаСФункциямиКлиентСервер.Ошибка(СтруктураВозврата) Тогда
		Возврат СтруктураВозврата;
	КонецЕсли;
	Соединение = ТУРВ_РаботаСФункциямиКлиентСервер.Результат(СтруктураВозврата);
			
	Запрос = Новый Запрос;
	Запрос.Текст = " ВЫБРАТЬ
					|	ВидыИспользованияРабочегоВремени.Ссылка КАК Ссылка,
					|	ВидыИспользованияРабочегоВремени.ПометкаУдаления КАК ПометкаУдаления,
					|	ВидыИспользованияРабочегоВремени.Наименование КАК Наименование,
					|	ВидыИспользованияРабочегоВремени.БуквенныйКод КАК БуквенныйКод,
					|	ВидыИспользованияРабочегоВремени.ОсновноеВремя КАК ОсновноеВремя,
					|	ВидыИспользованияРабочегоВремени.ИмяПредопределенныхДанных КАК ИмяПредопределенныхДанных
					|ИЗ
					|	Справочник.ВидыИспользованияРабочегоВремени КАК ВидыИспользованияРабочегоВремени
					|ГДЕ ВидыИспользованияРабочегоВремени.Ссылка = &Ссылка
					|";
	
	Запрос.Параметры.Вставить("Ссылка", ВидИспользованияРабочегоВремениСсылка); 
	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	Структура = Новый Структура;
	Структура.Вставить("time_name",  			Выборка.Наименование);
	Структура.Вставить("id_1c",      			Строка(ВидИспользованияРабочегоВремениСсылка.УникальныйИдентификатор()));
	Структура.Вставить("deleted",  	 			Выборка.ПометкаУдаления);
	Структура.Вставить("time_kod",  	 		Выборка.БуквенныйКод);
	Структура.Вставить("general_time_id_ic", 	Строка(Выборка.ОсновноеВремя.УникальныйИдентификатор()));
	Структура.Вставить("base_pk",    			НастройкиСервиса.ИДБазы);
	Структура.Вставить("time_name_id", 			Выборка.ИмяПредопределенныхДанных);
	ТелоЗапроса = ТУРВ_РаботаСJSONСервер.ЗаписатьJSON_АП(Структура);
	
	HTTPЗапрос = Новый HTTPЗапрос(РесурсНаСервере);
	HTTPЗапрос.УстановитьТелоИзСтроки(ТелоЗапроса);
	HTTPЗапрос.Заголовки.Вставить("Content-type",  "application/json; charset=utf-8");
	HTTPЗапрос.Заголовки.Вставить("Authorization", Токен);
	HTTPЗапрос.Заголовки.Вставить("ID",            ИД);
	
	СтруктураОтвета = ОтправитьЗапрос(	РесурсНаСервере, 
										Соединение, 
										ИД, 
										ТУРВ_ОбменДаннымиПовтИсп.МетодыЗапроса().ПОСТ, 
										HTTPЗапрос,  
										"ТУРБ_ОбменДанными.ДобавитьВидИспользованияРабочегоВремени.ОписаниеЗапроса",
										"pk");
										
	Возврат СтруктураОтвета;

КонецФункции

Функция ОбновитьВидИспользованияРабочегоВремени(НастройкиСервиса, Токен, ИД, ВидИспользованияРабочегоВремениСсылка) Экспорт 
	
	РесурсНаСервере = "/api/common/type-of-time"; 

    СтруктураВозврата = СоздатьСоединение(НастройкиСервиса, ИД);
	Если ТУРВ_РаботаСФункциямиКлиентСервер.Ошибка(СтруктураВозврата) Тогда
		Возврат СтруктураВозврата;
	КонецЕсли;
	Соединение = ТУРВ_РаботаСФункциямиКлиентСервер.Результат(СтруктураВозврата);
			
	Запрос = Новый Запрос;
	Запрос.Текст = " ВЫБРАТЬ
					|	ВидыИспользованияРабочегоВремени.Ссылка КАК Ссылка,
					|	ВидыИспользованияРабочегоВремени.ПометкаУдаления КАК ПометкаУдаления,
					|	ВидыИспользованияРабочегоВремени.Наименование КАК Наименование,
					|	ВидыИспользованияРабочегоВремени.БуквенныйКод КАК БуквенныйКод,
					|	ВидыИспользованияРабочегоВремени.ОсновноеВремя КАК ОсновноеВремя,
					|	ВидыИспользованияРабочегоВремени.ИмяПредопределенныхДанных КАК ИмяПредопределенныхДанных
					|ИЗ
					|	Справочник.ВидыИспользованияРабочегоВремени КАК ВидыИспользованияРабочегоВремени
					|ГДЕ ВидыИспользованияРабочегоВремени.Ссылка = &Ссылка
					|";
	
	Запрос.Параметры.Вставить("Ссылка", ВидИспользованияРабочегоВремениСсылка); 
	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	Структура = Новый Структура;
	Структура.Вставить("time_name",  			Выборка.Наименование);
	Структура.Вставить("id_1c",      			Строка(ВидИспользованияРабочегоВремениСсылка.УникальныйИдентификатор()));
	Структура.Вставить("deleted",  	 			Выборка.ПометкаУдаления);
	Структура.Вставить("time_kod",  	 		Выборка.БуквенныйКод);
	Структура.Вставить("general_time_id_ic", 	Строка(Выборка.ОсновноеВремя.УникальныйИдентификатор()));
	Структура.Вставить("time_name_id", 			Выборка.ИмяПредопределенныхДанных);
	Структура.Вставить("base_pk",    			НастройкиСервиса.ИДБазы);
	ТелоЗапроса = ТУРВ_РаботаСJSONСервер.ЗаписатьJSON_АП(Структура);
	
	HTTPЗапрос = Новый HTTPЗапрос(РесурсНаСервере);
	HTTPЗапрос.УстановитьТелоИзСтроки(ТелоЗапроса);
	HTTPЗапрос.Заголовки.Вставить("Content-type",  "application/json; charset=utf-8");
	HTTPЗапрос.Заголовки.Вставить("Authorization", Токен);
	HTTPЗапрос.Заголовки.Вставить("ID",            ИД);
	
	СтруктураОтвета = ОтправитьЗапрос(	РесурсНаСервере, 
										Соединение, 
										ИД, 
										ТУРВ_ОбменДаннымиПовтИсп.МетодыЗапроса().ПАТЧ, 
										HTTPЗапрос,  
										"ТУРБ_ОбменДанными.ОбновитьВидИспользованияРабочегоВремени.ОписаниеЗапроса",
										"pk");
										
	Возврат СтруктураОтвета;

КонецФункции

#КонецОбласти

#Область ГрафикиРаботы

Функция ДобавитьГрафикРаботы(НастройкиСервиса, Токен, ИД, ГрафикРаботыСсылка) Экспорт 
	
	РесурсНаСервере = "/api/common/work-schedule"; 

    СтруктураВозврата = СоздатьСоединение(НастройкиСервиса, ИД);
	Если ТУРВ_РаботаСФункциямиКлиентСервер.Ошибка(СтруктураВозврата) Тогда
		Возврат СтруктураВозврата;
	КонецЕсли;
	Соединение = ТУРВ_РаботаСФункциямиКлиентСервер.Результат(СтруктураВозврата);
			
	Наименование = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ГрафикРаботыСсылка, "Наименование");	
	
	Структура = Новый Структура;
	Структура.Вставить("id_1c",  				ГрафикРаботыСсылка);
	Структура.Вставить("title",      			Наименование);
	Структура.Вставить("base_pk",    			НастройкиСервиса.ИДБазы);
	ТелоЗапроса = ТУРВ_РаботаСJSONСервер.ЗаписатьJSON_АП(Структура);
	
	HTTPЗапрос = Новый HTTPЗапрос(РесурсНаСервере);
	HTTPЗапрос.УстановитьТелоИзСтроки(ТелоЗапроса);
	HTTPЗапрос.Заголовки.Вставить("Content-type",  "application/json; charset=utf-8");
	HTTPЗапрос.Заголовки.Вставить("Authorization", Токен);
	HTTPЗапрос.Заголовки.Вставить("ID",            ИД);
	
	СтруктураОтвета = ОтправитьЗапрос(	РесурсНаСервере, 
										Соединение, 
										ИД, 
										ТУРВ_ОбменДаннымиПовтИсп.МетодыЗапроса().ПОСТ, 
										HTTPЗапрос,  
										"ТУРБ_ОбменДанными.ДобавитьГрафикРаботы.ОписаниеЗапроса",
										"");
										
	Возврат СтруктураОтвета;

КонецФункции

Функция ОбновитьГрафикРаботы(НастройкиСервиса, Токен, ИД, ГрафикРаботыСсылка) Экспорт 
	
	РесурсНаСервере = "/api/common/work-schedule"; 

    СтруктураВозврата = СоздатьСоединение(НастройкиСервиса, ИД);
	Если ТУРВ_РаботаСФункциямиКлиентСервер.Ошибка(СтруктураВозврата) Тогда
		Возврат СтруктураВозврата;
	КонецЕсли;
	Соединение = ТУРВ_РаботаСФункциямиКлиентСервер.Результат(СтруктураВозврата);
			
	Наименование = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ГрафикРаботыСсылка, "Наименование");	
	
	Структура = Новый Структура;
	Структура.Вставить("id_1c",  				ГрафикРаботыСсылка);
	Структура.Вставить("title",      			Наименование);
	Структура.Вставить("base_pk",    			НастройкиСервиса.ИДБазы);
	ТелоЗапроса = ТУРВ_РаботаСJSONСервер.ЗаписатьJSON_АП(Структура);
	
	HTTPЗапрос = Новый HTTPЗапрос(РесурсНаСервере);
	HTTPЗапрос.УстановитьТелоИзСтроки(ТелоЗапроса);
	HTTPЗапрос.Заголовки.Вставить("Content-type",  "application/json; charset=utf-8");
	HTTPЗапрос.Заголовки.Вставить("Authorization", Токен);
	HTTPЗапрос.Заголовки.Вставить("ID",            ИД);
	
	СтруктураОтвета = ОтправитьЗапрос(	РесурсНаСервере, 
										Соединение, 
										ИД, 
										ТУРВ_ОбменДаннымиПовтИсп.МетодыЗапроса().ПАТЧ, 
										HTTPЗапрос,  
										"ТУРБ_ОбменДанными.ОбновитьГрафикРаботы.ОписаниеЗапроса",
										"");
										
	Возврат СтруктураОтвета;

КонецФункции

#КонецОбласти

#КонецОбласти

#Область Пользователи

Функция СоздатьПользователя(НастройкиСервиса, Токен, ФизЛицоСсылка, ЛогинПользователя, ПарольПользователя) Экспорт 
	
	РесурсНаСервере = "/api/user"; 
	
    СтруктураВозврата = СоздатьСоединение(НастройкиСервиса, "");
	Если ТУРВ_РаботаСФункциямиКлиентСервер.Ошибка(СтруктураВозврата) Тогда
		Возврат СтруктураВозврата;
	КонецЕсли;
	Соединение = ТУРВ_РаботаСФункциямиКлиентСервер.Результат(СтруктураВозврата);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
					|	ФИОФизическихЛицСрезПоследних.Фамилия КАК Фамилия,
					|	ФИОФизическихЛицСрезПоследних.Имя КАК Имя,
					|	ФИОФизическихЛицСрезПоследних.Отчество КАК Отчество
					|ИЗ
					|	РегистрСведений.ФИОФизическихЛиц.СрезПоследних КАК ФИОФизическихЛицСрезПоследних
					|ГДЕ
					|	ФИОФизическихЛицСрезПоследних.ФизическоеЛицо = &ФизическоеЛицо";
	
	Запрос.УстановитьПараметр("ФизическоеЛицо", ФизЛицоСсылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	Структура = Новый Структура;
	Структура.Вставить("user_name",     Выборка.Имя); 
	Структура.Вставить("base_pk",    	НастройкиСервиса.ИДБазы);
	Структура.Вставить("surname",       Выборка.Фамилия);
	Структура.Вставить("patronymic",    Выборка.Отчество);
	Структура.Вставить("id_1c",         ФизЛицоСсылка);
	Структура.Вставить("email",         ЛогинПользователя);
	Структура.Вставить("user_password", ПарольПользователя);
	ТелоЗапроса = ТУРВ_РаботаСJSONСервер.ЗаписатьJSON_АП(Структура);
	
	HTTPЗапрос = Новый HTTPЗапрос(РесурсНаСервере);
	HTTPЗапрос.УстановитьТелоИзСтроки(ТелоЗапроса);
	HTTPЗапрос.Заголовки.Вставить("Content-type", "application/json; charset=utf-8");
	HTTPЗапрос.Заголовки.Вставить("Authorization", Токен);
		
	СтруктураОтвета = ОтправитьЗапрос(	РесурсНаСервере, 
										Соединение, 
										"", 
										ТУРВ_ОбменДаннымиПовтИсп.МетодыЗапроса().ПОСТ, 
										HTTPЗапрос,  
										"ТУРБ_ОбменДанными.СоздатьПользователя.ОписаниеЗапроса",
										"pk");
										
	Если Не ТУРВ_РаботаСФункциямиКлиентСервер.Ошибка(СтруктураОтвета) Тогда									
		
		МенеджерЗаписи                = РегистрыСведений.ТУРВ_Пользователи.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.ФизическоеЛицо = ФизЛицоСсылка;
		МенеджерЗаписи.id             = ТУРВ_РаботаСФункциямиКлиентСервер.Результат(СтруктураОтвета);
		МенеджерЗаписи.Логин          = ЛогинПользователя;
		МенеджерЗаписи.Пароль         = ПарольПользователя;
		МенеджерЗаписи.Записать();
		
	КонецЕсли;
	
	Возврат СтруктураОтвета;	
	
КонецФункции	

Функция ОбновитьПользователя(НастройкиСервиса, Токен, ФизЛицоСсылка, ЛогинПользователя, ПарольПользователя) Экспорт
	
	РесурсНаСервере = "/api/user"; 
	
    СтруктураВозврата = СоздатьСоединение(НастройкиСервиса, "");
	Если ТУРВ_РаботаСФункциямиКлиентСервер.Ошибка(СтруктураВозврата) Тогда
		Возврат СтруктураВозврата;
	КонецЕсли;
	Соединение = ТУРВ_РаботаСФункциямиКлиентСервер.Результат(СтруктураВозврата);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
					|	ФИОФизическихЛицСрезПоследних.Фамилия КАК Фамилия,
					|	ФИОФизическихЛицСрезПоследних.Имя КАК Имя,
					|	ФИОФизическихЛицСрезПоследних.Отчество КАК Отчество,
					|	ТУРБ_ПользователиЛК.id КАК id,
					|	ТУРБ_ПользователиЛК.Логин КАК Логин,
					|	ТУРБ_ПользователиЛК.Пароль КАК Пароль
					
					|ИЗ
					|	РегистрСведений.ФИОФизическихЛиц.СрезПоследних КАК ФИОФизическихЛицСрезПоследних
					|  				ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ТУРБ_ПользователиЛК КАК ТУРБ_ПользователиЛК
					|			ПО ФИОФизическихЛицСрезПоследних.ФизическоеЛицо = ТУРБ_ПользователиЛК.ФизическоеЛицо
					
					|ГДЕ
					|	ФИОФизическихЛицСрезПоследних.ФизическоеЛицо = &ФизическоеЛицо";
	
	Запрос.УстановитьПараметр("ФизическоеЛицо", ФизЛицоСсылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	Структура = Новый Структура;
	Структура.Вставить("user_name",     Выборка.Имя);
	Структура.Вставить("surname",       Выборка.Фамилия);
	Структура.Вставить("patronymic",    Выборка.Отчество);
	Структура.Вставить("id_1c",         ФизЛицоСсылка);
	Структура.Вставить("email",         Выборка.Логин);
	Структура.Вставить("user_password", Выборка.Пароль);
	Структура.Вставить("pk",            Выборка.id);
	Структура.Вставить("base_pk",    	НастройкиСервиса.ИДБазы);
	ТелоЗапроса = ТУРВ_РаботаСJSONСервер.ЗаписатьJSON_АП(Структура);

	HTTPЗапрос = Новый HTTPЗапрос(РесурсНаСервере);
	HTTPЗапрос.УстановитьТелоИзСтроки(ТелоЗапроса);
	HTTPЗапрос.Заголовки.Вставить("Content-type", "application/json; charset=utf-8");
	HTTPЗапрос.Заголовки.Вставить("Authorization", Токен);
		
	СтруктураОтвета = ОтправитьЗапрос(	РесурсНаСервере, 
										Соединение, 
										"", 
										ТУРВ_ОбменДаннымиПовтИсп.МетодыЗапроса().ПУТ, 
										HTTPЗапрос,  
										"ТУРБ_ОбменДанными.ДобавитьОбновитьОрганизацию.ОписаниеЗапроса",
										"pk");		
										
	Если Не ТУРВ_РаботаСФункциямиКлиентСервер.Ошибка(СтруктураОтвета) Тогда

		МенеджерЗаписи                = РегистрыСведений.ТУРВ_Пользователи.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.ФизическоеЛицо = ФизЛицоСсылка;
		МенеджерЗаписи.id             = ТУРВ_РаботаСФункциямиКлиентСервер.Результат(СтруктураВозврата);
		МенеджерЗаписи.Логин          = ЛогинПользователя;
		МенеджерЗаписи.Пароль         = ПарольПользователя;
		МенеджерЗаписи.Записать();
		
	КонецЕсли;
	
	Возврат СтруктураОтвета;	
	
КонецФункции

Функция ОбновитьФотоПользователя(НастройкиСервиса, Токен, ИД, ФизЛицоСсылка) Экспорт 
	
	РесурсНаСервере = "/api/picture"; 
	
	СтруктураВозврата = СоздатьСоединение(НастройкиСервиса, ИД);
	Если ТУРВ_РаботаСФункциямиКлиентСервер.Ошибка(СтруктураВозврата) Тогда
		Возврат СтруктураВозврата;
	КонецЕсли;
	Соединение = ТУРВ_РаботаСФункциямиКлиентСервер.Результат(СтруктураВозврата);
	
	Запрос = Новый Запрос;
	Запрос.Текст ="ВЫБРАТЬ 
					|	ФотографииФизическихЛиц.ФизическоеЛицо,
					|	ФотографииФизическихЛиц.Фотография
					|ИЗ
					|	РегистрСведений.ФотографииФизическихЛиц КАК ФотографииФизическихЛиц
					|ГДЕ
					|	ФотографииФизическихЛиц.ФизическоеЛицо = &ФизическоеЛицо";
	
	Запрос.УстановитьПараметр("ФизическоеЛицо", ФизЛицоСсылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ФотоДвочныеДанные = Неопределено;
	
	Если Не РезультатЗапроса.Пустой() Тогда		
		
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		ФотоДвочныеДанные = Выборка.Фотография.Получить();
		
	КонецЕсли;
		
	HTTPЗапрос = Новый HTTPЗапрос(РесурсНаСервере);		
	
	Если ФотоДвочныеДанные <> Неопределено Тогда  
		
		Разделитель = "--------------------------469740299757949141411855";
		HTTPЗапрос.Заголовки.Вставить("Content-type", "multipart/form-data; boundary=" + Разделитель);
		
		СообщениеТекстAutho     = СоздатьСообщение_Текст("""Authorization""", Токен);
		СообщениеТекстID        = СоздатьСообщение_Текст("""ID""", ИД);
		СообщениеТекст_Ид1с 	= СоздатьСообщение_Текст("""userId1c""", Строка(ФизЛицоСсылка.УникальныйИдентификатор()));
		СообщениеТекст_ИдБазы1с = СоздатьСообщение_Текст("""base_pk""", "" + НастройкиСервиса.ИДБазы);
		СообщениеКартинка 		= СоздатьСообщение_Изображение("""image""", """" + Строка(ФизЛицоСсылка.УникальныйИдентификатор()) + ".png""", ФотоДвочныеДанные);
		
		Тело = Новый ПотокВПамяти();
		ЗаписьДанных = Новый ЗаписьДанных(Тело);
		ЗаписьДанных.ЗаписатьСтроку("--" + Разделитель);
		ЗаписьДанных.Записать(СообщениеТекстAutho);
		ЗаписьДанных.ЗаписатьСтроку("--" + Разделитель);
		ЗаписьДанных.Записать(СообщениеТекстID);
		ЗаписьДанных.ЗаписатьСтроку("--" + Разделитель);
		ЗаписьДанных.Записать(СообщениеТекст_Ид1с);
		ЗаписьДанных.ЗаписатьСтроку("--" + Разделитель);
		ЗаписьДанных.Записать(СообщениеТекст_ИдБазы1с);		
		ЗаписьДанных.ЗаписатьСтроку("--" + Разделитель);
		ЗаписьДанных.Записать(СообщениеКартинка);
		ЗаписьДанных.ЗаписатьСтроку("--" + Разделитель);
		ЗаписьДанных.ЗаписатьСтроку("--" + Разделитель + "--");
		ЗаписьДанных.Закрыть();
		ДанныеТела = Тело.ЗакрытьИПолучитьДвоичныеДанные();
		HTTPЗапрос.УстановитьТелоИзДвоичныхДанных(ДанныеТела);
		
	Иначе 
		
		Структура = Новый Структура;
		Структура.Вставить("userId1c", ФизЛицоСсылка);
		Структура.Вставить("base_pk",  НастройкиСервиса.ИДБазы);
		ТелоЗапроса = ТУРВ_РаботаСJSONСервер.ЗаписатьJSON_АП(Структура);
		
		HTTPЗапрос.Заголовки.Вставить("Content-type",  "application/json; charset=utf-8");
		HTTPЗапрос.Заголовки.Вставить("Authorization", Токен);
		HTTPЗапрос.Заголовки.Вставить("ID",            ИД);

		HTTPЗапрос.УстановитьТелоИзСтроки(ТелоЗапроса);			
		
	КонецЕсли;	 
		
	СтруктураОтвета = ОтправитьЗапрос(	РесурсНаСервере, 
										Соединение, 
										ИД, 
										ТУРВ_ОбменДаннымиПовтИсп.МетодыЗапроса().ПОСТ, 
										HTTPЗапрос,  
										"ТУРБ_ОбменДанными.ДобавитьОбновитьОрганизацию.ОписаниеЗапроса",
										"");
	
	Возврат СтруктураОтвета;	
	
КонецФункции

#КонецОбласти

#Область Сотрудники

Функция СоздатьСотрудника(НастройкиСервиса, Токен, ИД, СотрудникСсылка) Экспорт 
	
	РесурсНаСервере = "/api/employee"; 

    СтруктураВозврата = СоздатьСоединение(НастройкиСервиса, ИД);
	Если ТУРВ_РаботаСФункциямиКлиентСервер.Ошибка(СтруктураВозврата) Тогда
		Возврат СтруктураВозврата;
	КонецЕсли;
	Соединение = ТУРВ_РаботаСФункциямиКлиентСервер.Результат(СтруктураВозврата);
		
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
					|	ФИОФизическихЛицСрезПоследних.Фамилия КАК Фамилия,
					|	ФИОФизическихЛицСрезПоследних.Имя КАК Имя,
					|	ФИОФизическихЛицСрезПоследних.Отчество КАК Отчество,
					|	ТУРБ_ПользователиЛК.id КАК id,
					|	ТУРБ_ПользователиЛК.Логин КАК Логин,
					|	ТУРБ_ПользователиЛК.Пароль КАК Пароль,
					|	Сотрудники.ФизическоеЛицо КАК ФизическоеЛицо
					|ИЗ
					|	Справочник.Сотрудники КАК Сотрудники
					|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизическихЛиц.СрезПоследних КАК ФИОФизическихЛицСрезПоследних
					|			ПО Сотрудники.ФизическоеЛицо = ФИОФизическихЛицСрезПоследних.ФизическоеЛицо
					|  		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ТУРБ_ПользователиЛК КАК ТУРБ_ПользователиЛК
					|			ПО ФИОФизическихЛицСрезПоследних.ФизическоеЛицо = ТУРБ_ПользователиЛК.ФизическоеЛицо		
					|ГДЕ
					|	Сотрудники.Ссылка = &СотрудникСсылка";
	
	Запрос.УстановитьПараметр("СотрудникСсылка", СотрудникСсылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	Структура = Новый Структура;
	Структура.Вставить("pk",         Строка(СотрудникСсылка.УникальныйИдентификатор()));
	Структура.Вставить("user_id_1c", Строка(Выборка.ФизическоеЛицо.УникальныйИдентификатор()));
	Структура.Вставить("base_pk",    НастройкиСервиса.ИДБазы);
	ТелоЗапроса = ТУРВ_РаботаСJSONСервер.ЗаписатьJSON_АП(Структура);
	
	HTTPЗапрос = Новый HTTPЗапрос(РесурсНаСервере);
	HTTPЗапрос.УстановитьТелоИзСтроки(ТелоЗапроса);
	HTTPЗапрос.Заголовки.Вставить("Content-type",  "application/json; charset=utf-8");
	HTTPЗапрос.Заголовки.Вставить("Authorization", Токен);
	HTTPЗапрос.Заголовки.Вставить("ID",            ИД);
	
	СтруктураОтвета = ОтправитьЗапрос(	РесурсНаСервере, 
										Соединение, 
										ИД, 
										ТУРВ_ОбменДаннымиПовтИсп.МетодыЗапроса().ПОСТ, 
										HTTPЗапрос,  
										"ТУРБ_ОбменДанными.ДобавитьОбновитьОрганизацию.ОписаниеЗапроса",
										"pk");
										
	Возврат СтруктураОтвета;	
	
КонецФункции	

#КонецОбласти

#Область КадроваяИстория

Функция СоздатьЗаписьКадровойИстории(ИД, НастройкиСервиса, Токен, СотрудникСсылка, ПодразделениеСсылка, ДолжностьСсылка, ДатаНачала) Экспорт 
	
	РесурсНаСервере = "/api/employee/workplace"; 

    СтруктураВозврата = СоздатьСоединение(НастройкиСервиса, ИД);
	Если ТУРВ_РаботаСФункциямиКлиентСервер.Ошибка(СтруктураВозврата) Тогда
		Возврат СтруктураВозврата;
	КонецЕсли;
	Соединение = ТУРВ_РаботаСФункциямиКлиентСервер.Результат(СтруктураВозврата);
		
	Структура = Новый Структура;
	Структура.Вставить("position_pk",    ДолжностьСсылка);
	Структура.Вставить("subdivision_pk", ПодразделениеСсылка);
	Структура.Вставить("employee_pk",    СотрудникСсылка);
	Структура.Вставить("date_from",      ДатаНачала);
	Структура.Вставить("base_pk",        НастройкиСервиса.ИДБазы);
	ТелоЗапроса = ТУРВ_РаботаСJSONСервер.ЗаписатьJSON_АП(Структура);
	
	HTTPЗапрос = Новый HTTPЗапрос(РесурсНаСервере);		
	HTTPЗапрос.УстановитьТелоИзСтроки(ТелоЗапроса);
	HTTPЗапрос.Заголовки.Вставить("Content-type",  "application/json; charset=utf-8");
	HTTPЗапрос.Заголовки.Вставить("Authorization", Токен);
	HTTPЗапрос.Заголовки.Вставить("ID",            ИД);
		
	СтруктураОтвета = ОтправитьЗапрос(	РесурсНаСервере, 
										Соединение, 
										ИД, 
										ТУРВ_ОбменДаннымиПовтИсп.МетодыЗапроса().ПОСТ, 
										HTTPЗапрос,  
										"ТУРБ_ОбменДанными.ДобавитьОбновитьОрганизацию.ОписаниеЗапроса",
										"pk");	
	
	Возврат СтруктураОтвета;	
	
КонецФункции

Функция СоздатьОбновитьКадровойИсториюСотрудника(ИД, НастройкиСервиса, Токен, СотрудникСсылка, МассивРабочихМест) Экспорт 
	
	РесурсНаСервере = "/api/employee/workplaces"; 

    СтруктураВозврата = СоздатьСоединение(НастройкиСервиса, ИД);
	Если ТУРВ_РаботаСФункциямиКлиентСервер.Ошибка(СтруктураВозврата) Тогда
		Возврат СтруктураВозврата;
	КонецЕсли;
	Соединение = ТУРВ_РаботаСФункциямиКлиентСервер.Результат(СтруктураВозврата);
		
	Структура = Новый Структура;
	Структура.Вставить("employee_pk",    СотрудникСсылка);
	Структура.Вставить("base_pk",        НастройкиСервиса.ИДБазы); 
	Структура.Вставить("workplaces",     МассивРабочихМест);

	ТелоЗапроса = ТУРВ_РаботаСJSONСервер.ЗаписатьJSON_АП(Структура);
	
	HTTPЗапрос = Новый HTTPЗапрос(РесурсНаСервере);		
	HTTPЗапрос.УстановитьТелоИзСтроки(ТелоЗапроса);
	HTTPЗапрос.Заголовки.Вставить("Content-type",  "application/json; charset=utf-8");
	HTTPЗапрос.Заголовки.Вставить("Authorization", Токен);
	HTTPЗапрос.Заголовки.Вставить("ID",            ИД);
		
	СтруктураОтвета = ОтправитьЗапрос(	РесурсНаСервере, 
										Соединение, 
										ИД, 
										ТУРВ_ОбменДаннымиПовтИсп.МетодыЗапроса().ПОСТ, 
										HTTPЗапрос,  
										"ТУРБ_ОбменДанными.ДобавитьОбновитьОрганизацию.ОписаниеЗапроса",
										"pk");	
	
	Возврат СтруктураОтвета;	
	
КонецФункции

Функция УдалитьЗаписьКадровойИстории(ИД, НастройкиСервиса, Токен, СотрудникСсылка) Экспорт 
	
	РесурсНаСервере = "/api/employee/workplace"; 
	
	СтруктураВозврата = СоздатьСоединение(НастройкиСервиса, ИД);
	Если ТУРВ_РаботаСФункциямиКлиентСервер.Ошибка(СтруктураВозврата) Тогда
		Возврат СтруктураВозврата;
	КонецЕсли;
	Соединение = ТУРВ_РаботаСФункциямиКлиентСервер.Результат(СтруктураВозврата);
		
	Структура = Новый Структура;
	Структура.Вставить("employee_pk",    СотрудникСсылка);
	Структура.Вставить("base_pk",        НастройкиСервиса.ИДБазы);
	ТелоЗапроса = ТУРВ_РаботаСJSONСервер.ЗаписатьJSON_АП(Структура);
	
	HTTPЗапрос = Новый HTTPЗапрос(РесурсНаСервере);
	HTTPЗапрос.УстановитьТелоИзСтроки(ТелоЗапроса);
	HTTPЗапрос.Заголовки.Вставить("Content-type",  "application/json; charset=utf-8");
	HTTPЗапрос.Заголовки.Вставить("Authorization", Токен);
	HTTPЗапрос.Заголовки.Вставить("ID",            ИД);
		
	СтруктураОтвета = ОтправитьЗапрос(	РесурсНаСервере, 
										Соединение, 
										ИД, 
										ТУРВ_ОбменДаннымиПовтИсп.МетодыЗапроса().ДЕЛ, 
										HTTPЗапрос,  
										"ТУРБ_ОбменДанными.ДобавитьОбновитьОрганизацию.ОписаниеЗапроса",
										"pk");
										
	Возврат СтруктураВозврата;	
	
КонецФункции	

#КонецОбласти

Функция ДобавитьОбновитьГрафикРаботы(НастройкиСервиса, Токен, ИД, Месяц, Сотрудник) Экспорт 
	
	РесурсНаСервере = "/api/employee/work-schedule"; 

    СтруктураВозврата = СоздатьСоединение(НастройкиСервиса, ИД);
	Если ТУРВ_РаботаСФункциямиКлиентСервер.Ошибка(СтруктураВозврата) Тогда
		Возврат СтруктураВозврата;
	КонецЕсли;
	Соединение = ТУРВ_РаботаСФункциямиКлиентСервер.Результат(СтруктураВозврата);
	
	HTTPЗапрос = Новый HTTPЗапрос(РесурсНаСервере);
	HTTPЗапрос.Заголовки.Вставить("Content-type",  "application/json; charset=utf-8");
	HTTPЗапрос.Заголовки.Вставить("Authorization", Токен);
	HTTPЗапрос.Заголовки.Вставить("ID",            ИД);
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	Запрос.УстановитьПараметр("ДатаНачала", НачалоМесяца(Месяц));
	Запрос.УстановитьПараметр("ДатаОкончания", КонецМесяца(Месяц));
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	&Сотрудник КАК Сотрудник,
	               |	&ДатаНачала КАК ДатаНачала,
	               |	&ДатаОкончания КАК ДатаОкончания
	               |ПОМЕСТИТЬ ВТСотрудники";
	
	Запрос.Выполнить();
	
	ПараметрыЗаполнения = УчетРабочегоВремениРасширенный.ПараметрыДляЗапросВТДанныеУчетаВремениИСостоянийСотрудников();
	ПараметрыЗаполнения.ИмяВТСотрудники = "ВТСотрудники";
	ПараметрыЗаполнения.ИмяВТРезультат = "ВТДанныеУчетаВремени";
	ПараметрыЗаполнения.РассчитыватьПлановоеВремя = Ложь;
	ПараметрыЗаполнения.ДатаАктуальности  = НачалоМесяца(Месяц);
	ПараметрыЗаполнения.ДатаНачала = НачалоМесяца(Месяц);
	ПараметрыЗаполнения.ДатаОкончания = КонецМесяца(Месяц);
	ПараметрыЗаполнения.МесяцДатаНачала = ПараметрыЗаполнения.ДатаНачала;
	ПараметрыЗаполнения.МесяцДатаОкончания = ПараметрыЗаполнения.ДатаОкончания;
	ПараметрыЗаполнения.ВыделятьВыходныеВПериодыОтклонений = Ложь;
	ПараметрыЗаполнения.ПолучатьУсловияТрудаИТерритории = Истина;
	УчетРабочегоВремениРасширенный.СоздатьВТДанныеУчетаВремениИСостоянийСотрудников(Запрос.МенеджерВременныхТаблиц, Истина, ПараметрыЗаполнения);
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ДанныеУчетаВремени.Сотрудник КАК Сотрудник,
	               |	ДанныеУчетаВремени.Дата КАК Дата,
	               |	ДанныеУчетаВремени.Часы КАК Часы,
				   |	ДанныеУчетаВремени.ВидУчетаВремени КАК ВидУчетаВремени
				   |ИЗ
	               |	ВТДанныеУчетаВремени КАК ДанныеУчетаВремени
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Сотрудник,
	               |	Дата";
	
	ТЗ = Запрос.Выполнить().Выгрузить();

	
	УстановитьПривилегированныйРежим(Ложь);
	МассивСтрок = Новый Массив;

	Для Каждого СтрокаТЗ Из ТЗ Цикл
		
		Структура = Новый Структура;
		Структура.Вставить("work_date",            СтрокаТЗ.Дата);
		Структура.Вставить("work_hour",            СтрокаТЗ.Часы);
		Структура.Вставить("types_of_time_id_1c",  СтрокаТЗ.ВидУчетаВремени);
		МассивСтрок.Добавить(Структура);
		
	КонецЦикла; 
		
	Структура = Новый Структура;
	Структура.Вставить("emloyee_id_1c", Сотрудник);
	Структура.Вставить("base_pk",    	НастройкиСервиса.ИДБазы);
	Структура.Вставить("begin_date",    Месяц);
	Структура.Вставить("begin_date",    КонецМесяца(Месяц));
	Структура.Вставить("items", МассивСтрок);		
	ТелоЗапроса = ТУРВ_РаботаСJSONСервер.ЗаписатьJSON_АП(Структура);
	
	HTTPЗапрос.УстановитьТелоИзСтроки(ТелоЗапроса);
	
	СтруктураОтвета = ОтправитьЗапрос(	РесурсНаСервере, 
										Соединение, 
										ИД, 
										ТУРВ_ОбменДаннымиПовтИсп.МетодыЗапроса().ПОСТ, 
										HTTPЗапрос,  
										"ТУРБ_ОбменДанными.ДобавитьОбновитьГрафикРаботы.ОписаниеЗапроса",
										"");	
	Возврат СтруктураОтвета;	
	
КонецФункции

Функция ОбновитьГрафикиРаботыПоВидамВремения(НастройкиСервиса, Токен, ИД, ГрафикРаботыСсылка, Месяц) Экспорт 
	
	РесурсНаСервере = "/api/common/general-work-schedules-data"; 

    СтруктураВозврата = СоздатьСоединение(НастройкиСервиса, ИД);
	Если ТУРВ_РаботаСФункциямиКлиентСервер.Ошибка(СтруктураВозврата) Тогда
		Возврат СтруктураВозврата;
	КонецЕсли;
	Соединение = ТУРВ_РаботаСФункциямиКлиентСервер.Результат(СтруктураВозврата);
	
	HTTPЗапрос = Новый HTTPЗапрос(РесурсНаСервере);
	HTTPЗапрос.Заголовки.Вставить("Content-type",  "application/json; charset=utf-8");
	HTTPЗапрос.Заголовки.Вставить("Authorization", Токен);
	HTTPЗапрос.Заголовки.Вставить("ID",            ИД);
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
    Запрос.Текст = " ВЫБРАТЬ
					|	ГрафикиРаботыПоВидамВремени.Дата КАК Дата,
					|	ГрафикиРаботыПоВидамВремени.ВидУчетаВремени КАК ВидУчетаВремени,
					|	ГрафикиРаботыПоВидамВремени.ДополнительноеЗначение КАК ДополнительноеЗначение
					|ИЗ
					|	РегистрСведений.ГрафикиРаботыПоВидамВремени КАК ГрафикиРаботыПоВидамВремени
					|ГДЕ
					|	ГрафикиРаботыПоВидамВремени.ГрафикРаботы = &ГрафикРаботы
					|	И ГрафикиРаботыПоВидамВремени.Месяц = &Месяц
					|	И ГрафикиРаботыПоВидамВремени.ПереходящаяЧастьПредыдущейСмены = ЛОЖЬ
					|	И ГрафикиРаботыПоВидамВремени.ПереходящаяЧастьТекущейСмены = ЛОЖЬ
					|   И ГрафикиРаботыПоВидамВремени.ВидУчетаВремени <> ЗНАЧЕНИЕ(Справочник.ВидыИспользованияРабочегоВремени.РабочееВремя)
					|";
	Запрос.Параметры.Вставить("ГрафикРаботы", ГрафикРаботыСсылка); 
	Запрос.Параметры.Вставить("Месяц", Месяц); 
	
	УстановитьПривилегированныйРежим(Ложь);
	МассивСтрок = Новый Массив;

	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл 
		
		Структура = Новый Структура;
		Структура.Вставить("work_date",            Выборка.Дата);
		Структура.Вставить("work_hour",            Выборка.ДополнительноеЗначение);
		Структура.Вставить("types_of_time_id_1c",  Выборка.ВидУчетаВремени);
		МассивСтрок.Добавить(Структура);
		
	КонецЦикла; 
	
	Структура = Новый Структура;
	Структура.Вставить("work_schedule_id_1c", ГрафикРаботыСсылка);
	Структура.Вставить("base_pk",    	НастройкиСервиса.ИДБазы);
	Структура.Вставить("begin_date",    Месяц);
	Структура.Вставить("end_date",      КонецМесяца(Месяц));
	Структура.Вставить("items", МассивСтрок);		
	ТелоЗапроса = ТУРВ_РаботаСJSONСервер.ЗаписатьJSON_АП(Структура);
	
	HTTPЗапрос.УстановитьТелоИзСтроки(ТелоЗапроса);
	
	СтруктураОтвета = ОтправитьЗапрос(	РесурсНаСервере, 
										Соединение, 
										ИД, 
										ТУРВ_ОбменДаннымиПовтИсп.МетодыЗапроса().ПОСТ, 
										HTTPЗапрос,  
										"ТУРБ_ОбменДанными.ОбновитьГрафикиРаботыПоВидамВремения.ОписаниеЗапроса",
										"");	
	Возврат СтруктураОтвета;	
	
КонецФункции

Функция ОбновитьДанныеИндивидуальныхГрафиковСотрудников(НастройкиСервиса, Токен, ИД, СотрудникСсылка, Дата) Экспорт 
	
	РесурсНаСервере = "/api/employee/personal-work-schedules-data"; 

    СтруктураВозврата = СоздатьСоединение(НастройкиСервиса, ИД);
	Если ТУРВ_РаботаСФункциямиКлиентСервер.Ошибка(СтруктураВозврата) Тогда
		Возврат СтруктураВозврата;
	КонецЕсли;
	
	МассивПользователейЛК = ТУРВ_ОбменДаннымиПовтИсп.МассивПользователейЛК();
	
	ФизическоеЛицо = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СотрудникСсылка, "ФизическоеЛицо");
	
	Если МассивПользователейЛК.Найти(ФизическоеЛицо) = Неопределено  Тогда
		Возврат СтруктураВозврата;
	КонецЕсли;
	
	Соединение = ТУРВ_РаботаСФункциямиКлиентСервер.Результат(СтруктураВозврата);
	
	HTTPЗапрос = Новый HTTPЗапрос(РесурсНаСервере);
	HTTPЗапрос.Заголовки.Вставить("Content-type",  "application/json; charset=utf-8");
	HTTPЗапрос.Заголовки.Вставить("Authorization", Токен);
	HTTPЗапрос.Заголовки.Вставить("ID",            ИД);
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
    Запрос.Текст =" ВЫБРАТЬ
					|	ДанныеИндивидуальныхГрафиковСотрудников.ВидУчетаВремени КАК ВидУчетаВремени,
					|	СУММА(ДанныеИндивидуальныхГрафиковСотрудников.Часы) КАК Часы
					|ИЗ
					|	РегистрНакопления.ДанныеИндивидуальныхГрафиковСотрудников КАК ДанныеИндивидуальныхГрафиковСотрудников
					|ГДЕ
					|	ДанныеИндивидуальныхГрафиковСотрудников.Сотрудник = &Сотрудник
					|	И ДанныеИндивидуальныхГрафиковСотрудников.Период = &Период
					|   И ДанныеИндивидуальныхГрафиковСотрудников.ВидУчетаВремени <> ЗНАЧЕНИЕ(Справочник.ВидыИспользованияРабочегоВремени.РабочееВремя)
					|
					|СГРУППИРОВАТЬ ПО
					|	ДанныеИндивидуальныхГрафиковСотрудников.ВидУчетаВремени
					|";

	Запрос.Параметры.Вставить("Период", Дата); 
	Запрос.Параметры.Вставить("Сотрудник", СотрудникСсылка); 
	
	УстановитьПривилегированныйРежим(Ложь);
	МассивСтрок = Новый Массив;

	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл   
		
		Структура = Новый Структура;
		Структура.Вставить("work_hour",            Выборка.Часы);
		Структура.Вставить("types_of_time_id_1c",  Выборка.ВидУчетаВремени);
		МассивСтрок.Добавить(Структура);
		
	КонецЦикла; 
	
	Структура = Новый Структура;
	Структура.Вставить("employee_id_1c", СотрудникСсылка);
	Структура.Вставить("base_pk",    	 НастройкиСервиса.ИДБазы);
	Структура.Вставить("work_date",      Дата);
	Структура.Вставить("items", МассивСтрок);		
	ТелоЗапроса = ТУРВ_РаботаСJSONСервер.ЗаписатьJSON_АП(Структура);
	
	HTTPЗапрос.УстановитьТелоИзСтроки(ТелоЗапроса);
	
	СтруктураОтвета = ОтправитьЗапрос(	РесурсНаСервере, 
										Соединение, 
										ИД, 
										ТУРВ_ОбменДаннымиПовтИсп.МетодыЗапроса().ПОСТ, 
										HTTPЗапрос,  
										"ТУРБ_ОбменДанными.ОбновитьДанныеИндивидуальныхГрафиковСотрудников.ОписаниеЗапроса",
										"");	
	Возврат СтруктураОтвета;	
	
КонецФункции

Функция ОбновитьДанныеОГрафикахСотрудников(НастройкиСервиса, Токен, ИД, Сотрудник, Период) Экспорт 
	
	РесурсНаСервере = "/api/employee/employee-work-schedules-data"; 

    СтруктураВозврата = СоздатьСоединение(НастройкиСервиса, ИД);
	Если ТУРВ_РаботаСФункциямиКлиентСервер.Ошибка(СтруктураВозврата) Тогда
		Возврат СтруктураВозврата;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
    Запрос.Текст =" ВЫБРАТЬ
					|	ГрафикРаботыСотрудниковИнтервальный.Сотрудник КАК Сотрудник,
					|	ГрафикРаботыСотрудниковИнтервальный.ДатаНачала КАК ДатаНачала,
					|	ГрафикРаботыСотрудниковИнтервальный.ДатаОкончания КАК ДатаОкончания,
					|	ГрафикРаботыСотрудниковИнтервальный.ГрафикРаботы КАК ГрафикРаботы,
					|	&Период КАК ПериодИзменения
					|ИЗ
					|	РегистрСведений.ГрафикРаботыСотрудниковИнтервальный КАК ГрафикРаботыСотрудниковИнтервальный
					|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ТУРБ_ПользователиЛК КАК ТУРБ_ПользователиЛК
					|		ПО ГрафикРаботыСотрудниковИнтервальный.Сотрудник.ФизическоеЛицо = ТУРБ_ПользователиЛК.ФизическоеЛицо
					|ГДЕ
					|	(ГрафикРаботыСотрудниковИнтервальный.ДатаНачала >= &Период
					|			ИЛИ ГрафикРаботыСотрудниковИнтервальный.ДатаОкончания >= &Период
					|				И ГрафикРаботыСотрудниковИнтервальный.Сотрудник = &Сотрудник)
					
					|УПОРЯДОЧИТЬ ПО
					|	ДатаНачала
					|";
	Запрос.Параметры.Вставить("Период",    Период);
	Запрос.Параметры.Вставить("Сотрудник", Сотрудник);
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		Возврат СтруктураВозврата;
	КонецЕсли;	


	Соединение = ТУРВ_РаботаСФункциямиКлиентСервер.Результат(СтруктураВозврата);
	
	HTTPЗапрос = Новый HTTPЗапрос(РесурсНаСервере);
	HTTPЗапрос.Заголовки.Вставить("Content-type",  "application/json; charset=utf-8");
	HTTPЗапрос.Заголовки.Вставить("Authorization", Токен);
	HTTPЗапрос.Заголовки.Вставить("ID",            ИД);
	
	УстановитьПривилегированныйРежим(Ложь);
	МассивСтрок = Новый Массив;
	
	ПериодНачала = Период;
	ПерваяЗапись = Истина;
			
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Если ПерваяЗапись Тогда
			ПериодНачала = Выборка.ДатаНачала;
			ПерваяЗапись = Ложь;
		КонецЕсли;	
		
		СтруктураЗаписи = Новый Структура;
		СтруктураЗаписи.Вставить("date_from",            Выборка.ДатаНачала);
		СтруктураЗаписи.Вставить("date_to",              Выборка.ДатаОкончания);
		СтруктураЗаписи.Вставить("work_schedules_id_1c", Выборка.ГрафикРаботы);
		
		МассивСтрок.Добавить(СтруктураЗаписи);
		
	КонецЦикла;	
	
	Структура = Новый Структура;
	Структура.Вставить("base_pk",    	 НастройкиСервиса.ИДБазы);
	Структура.Вставить("employee_id_1c", Сотрудник);
	Структура.Вставить("date_from",  	 НачалоДня(ПериодНачала));
	Структура.Вставить("items", 		 МассивСтрок);		
	ТелоЗапроса = ТУРВ_РаботаСJSONСервер.ЗаписатьJSON_АП(Структура);
	
	HTTPЗапрос.УстановитьТелоИзСтроки(ТелоЗапроса);
	
	СтруктураОтвета = ОтправитьЗапрос(	РесурсНаСервере, 
										Соединение, 
										ИД, 
										ТУРВ_ОбменДаннымиПовтИсп.МетодыЗапроса().ПОСТ, 
										HTTPЗапрос,  
										"ТУРБ_ОбменДанными.ОбновитьДанныеОГрафикахСотрудников.ОписаниеЗапроса",
										"");	
	Возврат СтруктураОтвета;	
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СоздатьСоединение(НастройкиСервиса, ИД)
	
	СтруктураВозврата = ТУРВ_РаботаСФункциямиКлиентСервер.СтруктураВозврата();
	
	Попытка
		
		Соединение = Новый HTTPСоединение(НастройкиСервиса.АдресСервера, , , , );
		ТУРВ_РаботаСФункциямиКлиентСервер.ДобавитьРезультат(СтруктураВозврата, Соединение);
		
	Исключение
		
		ОписаниеОшибки = ОписаниеОшибки();
		ТУРВ_РаботаСФункциямиКлиентСервер.ДобавитьОшибку(СтруктураВозврата, ОписаниеОшибки);
		
		Объект = НастройкиСервиса.АдресСервера;
		ТУРВ_ЛогированиеСервер.ДобавитьЗаписьВЛог(	ТУРВ_ОбменДаннымиПовтИсп.УровниЛога().Ошибка,
											ТУРВ_ОбменДаннымиПовтИсп.СобытияЛога().Логин, 
											ТУРВ_ОбменДаннымиПовтИсп.УровниСобытийЛога().Ошибка,
											ТУРВ_ЛогированиеСервер.ДанныеJSONОбъектСтрока(ТУРВ_ОбменДаннымиПовтИсп.УровниЛога().Ошибка, 
																				ТУРВ_ЛогированиеСервер.ТекущаяДатаЛК(),
																				ИД,
																				ТУРВ_ОбменДаннымиПовтИсп.ТипыОбъектов().Токен,
																				"",
																				Объект, 
																				"ТУРБ_ОбменДанными.СоздатьСоединение", 
																				ОписаниеОшибки()));
		
	КонецПопытки;

	Возврат СтруктураВозврата;
	
КонецФункции

Функция ОтправитьЗапрос(РесурсНаСервере, Соединение,  ИД, Метод, HTTPЗапрос, Трасса, ПолеОтвета)
	
	СтруктураВозврата = ТУРВ_РаботаСФункциямиКлиентСервер.СтруктураВозврата();
	Попытка	
		
		ОписаниеЗапроса = ТУРВ_ЛогированиеСервер.ОписаниеЗапроса(ИД, РесурсНаСервере, HTTPЗапрос);
		ТУРВ_ЛогированиеСервер.ДобавитьЗаписьВЛог(  ТУРВ_ОбменДаннымиПовтИсп.УровниЛога().Дебаг,
											ТУРВ_ОбменДаннымиПовтИсп.СобытияЛога().ОтправкаЗапроса, 
											ТУРВ_ОбменДаннымиПовтИсп.УровниСобытийЛога().Информация, 
											ТУРВ_ЛогированиеСервер.ДанныеJSONОбъектJSON(ТУРВ_ОбменДаннымиПовтИсп.УровниЛога().Дебаг, 
																				ТУРВ_ЛогированиеСервер.ТекущаяДатаЛК(),
																				ИД,
																				ТУРВ_ОбменДаннымиПовтИсп.ТипыОбъектов().ЗпП,
																				"Запрос",
																				ОписаниеЗапроса, 
																				Трасса));					 
		
		HTTPОтвет  = Соединение.ВызватьHTTPМетод(Метод, HTTPЗапрос);
		
		ОписаниеОтвета = ТУРВ_ЛогированиеСервер.ОписаниеОтвета(ИД, HTTPОтвет);
		ТУРВ_ЛогированиеСервер.ДобавитьЗаписьВЛог(	ТУРВ_ОбменДаннымиПовтИсп.УровниЛога().Дебаг,
											ТУРВ_ОбменДаннымиПовтИсп.СобытияЛога().ПолучениеОтвета, 
											ТУРВ_ОбменДаннымиПовтИсп.УровниСобытийЛога().Информация,
											ТУРВ_ЛогированиеСервер.ДанныеJSONОбъектJSON(ТУРВ_ОбменДаннымиПовтИсп.УровниЛога().Дебаг, 
																				ТУРВ_ЛогированиеСервер.ТекущаяДатаЛК(),
																				ИД,
																				ТУРВ_ОбменДаннымиПовтИсп.ТипыОбъектов().ЗпП, 
																				"Ответ",
																				ОписаниеОтвета, 
																				Трасса));
		
	Исключение
		
		ОписаниеОшибки = ОписаниеОшибки();
		ТУРВ_РаботаСФункциямиКлиентСервер.ДобавитьОшибку(СтруктураВозврата, ОписаниеОшибки);
		
		ТУРВ_ЛогированиеСервер.ДобавитьЗаписьВЛог(	ТУРВ_ОбменДаннымиПовтИсп.УровниЛога().Ошибка,
											ТУРВ_ОбменДаннымиПовтИсп.СобытияЛога().ОшибкаПриОтправкеЗапроса, 
											ТУРВ_ОбменДаннымиПовтИсп.УровниСобытийЛога().Ошибка,			
											ТУРВ_ЛогированиеСервер.ДанныеJSONОбъектJSON(ТУРВ_ОбменДаннымиПовтИсп.УровниЛога().Ошибка, 
																				ТУРВ_ЛогированиеСервер.ТекущаяДатаЛК(),
																				ИД,
																				ТУРВ_ОбменДаннымиПовтИсп.ТипыОбъектов().Токен, 
																				"Запрос",
																				ОписаниеЗапроса, 
																				Трасса,
																				ОписаниеОшибки));
		Возврат СтруктураВозврата;
		
	КонецПопытки;

	СтруктураОтвета = РазобратьОтвет(   HTTPОтвет, ОписаниеОтвета, ИД, 
											ПолеОтвета, "ТУРБ_ОбменДанными.Логин", "Ошибка разбора ответа");
	Возврат СтруктураОтвета;

КонецФункции

Функция РазобратьОтвет(HTTPОтвет, ОписаниеОтвета, ИД, КлючОтвета, Трасса, СообщениеОбОшибке)
	
	СтруктураВозврата = ТУРВ_РаботаСФункциямиКлиентСервер.СтруктураВозврата();
	
	Если HTTPОтвет.КодСостояния > 299 Тогда
		
		ТУРВ_ЛогированиеСервер.ДобавитьЗаписьВЛог(	ТУРВ_ОбменДаннымиПовтИсп.УровниЛога().Ошибка,
											ТУРВ_ОбменДаннымиПовтИсп.СобытияЛога().ОшибкаПриПолученииОтвета, 
											ТУРВ_ОбменДаннымиПовтИсп.УровниСобытийЛога().Ошибка,
											ТУРВ_ЛогированиеСервер.ДанныеJSONОбъектJSON(ТУРВ_ОбменДаннымиПовтИсп.УровниЛога().Ошибка, 
																				ТУРВ_ЛогированиеСервер.ТекущаяДатаЛК(),
																				ИД,
																				ТУРВ_ОбменДаннымиПовтИсп.ТипыОбъектов().ОЗ, 
																				"Ответ",
																				ОписаниеОтвета, 
																				Трасса));
		Сообщение = СтрШаблон("Код состояния: %1. %2.", HTTPОтвет.КодСостояния, 
														"Действие не выполнено");
																		
		ContentType = HTTPОтвет.Заголовки.Получить("Content-Type");																		
		
		Если ContentType = "application/json; charset=utf-8" Тогда
			
			ТелоОтвета = HTTPОтвет.ПолучитьТелоКакСтроку();
			ТелоОтветаСоответствие = ТУРВ_РаботаСJSONСервер.ПрочитатьJSON_АП(ТелоОтвета);
			Message = ТелоОтветаСоответствие.Получить("message");
			Если Message <> Неопределено  Тогда
				Сообщение = СтрШаблон("Код состояния: %1. %2.", HTTPОтвет.КодСостояния, 
																Message);
			КонецЕсли;
			
		КонецЕсли;																		
		
		ТУРВ_РаботаСФункциямиКлиентСервер.ДобавитьОшибку(СтруктураВозврата, Сообщение);
		Возврат СтруктураВозврата;
		
	КонецЕсли;

	Если КлючОтвета <> "" Тогда 	
		
		Результат = HTTPОтвет.ПолучитьТелоКакСтроку();
		РезультатОбъект = ТУРВ_РаботаСJSONСервер.ПрочитатьJSON_АП(Результат);
		
		Если РезультатОбъект.Получить(КлючОтвета) <> Неопределено Тогда
			ТУРВ_РаботаСФункциямиКлиентСервер.ДобавитьРезультат(СтруктураВозврата, РезультатОбъект[КлючОтвета]);
		Иначе
			
			ТУРВ_РаботаСФункциямиКлиентСервер.ДобавитьОшибку(СтруктураВозврата, СообщениеОбОшибке);	
			
			ТУРВ_ЛогированиеСервер.ДобавитьЗаписьВЛог(	ТУРВ_ОбменДаннымиПовтИсп.УровниЛога().Ошибка,
												ТУРВ_ОбменДаннымиПовтИсп.СобытияЛога().ОшибкаПриПолученииОтвета, 
												ТУРВ_ОбменДаннымиПовтИсп.УровниСобытийЛога().Ошибка,				
												ТУРВ_ЛогированиеСервер.ДанныеJSONОбъектJSON(ТУРВ_ОбменДаннымиПовтИсп.УровниЛога().Ошибка, 
																					ТУРВ_ЛогированиеСервер.ТекущаяДатаЛК(),
																					ИД,
																					ТУРВ_ОбменДаннымиПовтИсп.ТипыОбъектов().ОЗ,
																					"Ответ",
																					ОписаниеОтвета, 
																					Трасса),
																					СообщениеОбОшибке);
		КонецЕсли;

	КонецЕсли;																		

	Возврат СтруктураВозврата;
	
КонецФункции

Функция ДобавитьОбновитьОрганизацию(НастройкиСервиса, Токен, ИД, ОрганизацияСсылка) 
	
	РесурсНаСервере = "/api/common/organisation";
	
	НаименованиеОрганизации = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ОрганизацияСсылка, "НаименованиеСокращенное");
	
    СтруктураВозврата = СоздатьСоединение(НастройкиСервиса, ИД);
	Если ТУРВ_РаботаСФункциямиКлиентСервер.Ошибка(СтруктураВозврата) Тогда
		Возврат СтруктураВозврата;
	КонецЕсли;
	Соединение = ТУРВ_РаботаСФункциямиКлиентСервер.Результат(СтруктураВозврата);
	
	Структура = Новый Структура;
	Структура.Вставить("organization_name", НаименованиеОрганизации);
	Структура.Вставить("pk",                ОрганизацияСсылка);
	Структура.Вставить("base_pk",           НастройкиСервиса.ИДБазы);
	ТелоЗапроса = ТУРВ_РаботаСJSONСервер.ЗаписатьJSON_АП(Структура);

	HTTPЗапрос = Новый HTTPЗапрос(РесурсНаСервере);
	HTTPЗапрос.Заголовки.Вставить("Content-type",  "application/json; charset=utf-8");
	HTTPЗапрос.Заголовки.Вставить("Authorization", Токен);
	HTTPЗапрос.Заголовки.Вставить("ID",            ИД);
	HTTPЗапрос.УстановитьТелоИзСтроки(ТелоЗапроса);
	
	СтруктураОтвета = ОтправитьЗапрос(	РесурсНаСервере, 
										Соединение, 
										ИД, 
										ТУРВ_ОбменДаннымиПовтИсп.МетодыЗапроса().ПОСТ, 
										HTTPЗапрос,  
										"ТУРБ_ОбменДанными.ДобавитьОбновитьОрганизацию.ОписаниеЗапроса",
										"pk");
										
	Возврат СтруктураОтвета;		
	
КонецФункции	

Функция ДобавитьОбновитьПодразделение(НастройкиСервиса, Токен, ИД, ПодразделениеСсылка) 
	
	РесурсНаСервере = "/api/common/subdivision";
		
  	СтруктураВозврата = СоздатьСоединение(НастройкиСервиса, ИД);
	Если ТУРВ_РаботаСФункциямиКлиентСервер.Ошибка(СтруктураВозврата) Тогда
		Возврат СтруктураВозврата;
	КонецЕсли;
	Соединение = ТУРВ_РаботаСФункциямиКлиентСервер.Результат(СтруктураВозврата);
	
	РеквизитыПодразделения = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ПодразделениеСсылка, "Наименование, Родитель, Владелец");
	
	Структура = Новый Структура;
	Структура.Вставить("subdivision_name",  РеквизитыПодразделения.Наименование);
	Структура.Вставить("pk",                ПодразделениеСсылка);
	Структура.Вставить("parent_pk",         РеквизитыПодразделения.Родитель);
	Структура.Вставить("organization_pk",   РеквизитыПодразделения.Владелец);
	Структура.Вставить("base_pk",           НастройкиСервиса.ИДБазы);
	ТелоЗапроса = ТУРВ_РаботаСJSONСервер.ЗаписатьJSON_АП(Структура);
	
	HTTPЗапрос = Новый HTTPЗапрос(РесурсНаСервере);	
	HTTPЗапрос.УстановитьТелоИзСтроки(ТелоЗапроса);
	HTTPЗапрос.Заголовки.Вставить("Content-type",  "application/json; charset=utf-8");
	HTTPЗапрос.Заголовки.Вставить("Authorization", Токен);
	HTTPЗапрос.Заголовки.Вставить("ID",            ИД);
	
	СтруктураОтвета = ОтправитьЗапрос(	РесурсНаСервере, 
										Соединение, 
										ИД, 
										ТУРВ_ОбменДаннымиПовтИсп.МетодыЗапроса().ПОСТ, 
										HTTPЗапрос,  
										"ТУРБ_ОбменДанными.ДобавитьОбновитьПодразделение.ОписаниеЗапроса",
										"pk");
		
	Возврат СтруктураОтвета;;		
	
КонецФункции

// Возвращается HTTP-сообщение в виде ДвоичныеДанные
Функция СоздатьСообщение_Текст(ИмяСообщения, Текст)
	
	Поток = Новый ПотокВПамяти();
	ЗаписьДанных = Новый ЗаписьДанных(Поток);
	// Заголовки
	ЗаписьДанных.ЗаписатьСтроку("Content-Disposition: form-data; name=" + ИмяСообщения);
	ЗаписьДанных.ЗаписатьСтроку("");
	// Тело
	ЗаписьДанных.ЗаписатьСтроку(Текст);
	ЗаписьДанных.Закрыть();
	Возврат Поток.ЗакрытьИПолучитьДвоичныеДанные();
	
КонецФункции

// Возвращается HTTP-сообщение в виде ДвоичныеДанные
Функция СоздатьСообщение_Изображение(ИмяСообщения, ИмяФайла, КартинкаДвоичныеДанные)    
	
	Поток = Новый ПотокВПамяти();
	ЗаписьДанных = Новый ЗаписьДанных(Поток);
	// Заголовки
	ЗаписьДанных.ЗаписатьСтроку("Content-Disposition: form-data; name=" + ИмяСообщения + "; filename=" + имяФайла);
	ЗаписьДанных.ЗаписатьСтроку("Content-type: image/png");
	ЗаписьДанных.ЗаписатьСтроку("");
	// Тело
	ЗаписьДанных.Записать(КартинкаДвоичныеДанные);
	ЗаписьДанных.Закрыть();
	
	Возврат Поток.ЗакрытьИПолучитьДвоичныеДанные();
	
КонецФункции

#КонецОбласти